
const ZIWEI_DATA_P = {
  "子女": {
    "忌": {
      "夫妻": "1.先孕後婚。2.小孩喜歡黏纏配偶。3.小孩不宜多，防拖累〈沖事業〉。4.子女執於感情。5.6.合夥難成事或合夥緣不長久。",
      "父母": "1.小孩耿直、喜怒形色。2.格局好，小孩懂事、孝順、愛讀書、善體人意、說實話。3.格局差，小孩無理、偏激、不受教〈加權尤顯〉。4.合夥難成事或合夥緣不長久。",
      "兄弟": "1.小孩儉約、守成、工作安定。2.不性福，畫眉不樂、房事少趣。",
      "田宅": "1.格局好，小孩獨立性佳。小孩勤儉顧家、自立門戶。2.格局不佳，防子女私心、計較、爭財、爭產。會權尤顯。3.或子女覬覦產業、小人入宅、外賊侵內、禍事臨門、是非串戶。",
      "交友": "1.小孩惜情重義。2.子女小時候愛纏配偶。也防子女體質不佳。3.4.老運自珍重。〈注",
      "事業": "1.小孩事業心重。2.合夥難發展。不利於同行競爭。3.小心意外、災病（福德共宗六位忌入運氣宮）。（注",
      "命宮": "1.欠子債，小孩固執、難溝通或乖違〈健康、學業、行為〉，教養總多費心。2.子息緣薄或小孩少、沒出息。3.合夥運蹇滯，合夥不賺錢。4.不利於同行競爭。5.6.親戚情較淡。7.8.",
      "疾厄": "1.小孩愛纏我、溺我。2.當小孩小時不健康或過動不耐靜，但長大能獨立，也能吃苦耐勞。3.我不性福。或縱欲過度（桃花星）。4.5.合夥累人或合夥不如意。6.",
      "財帛": "1.小孩愛賺錢、或小孩收入固定。2.格局差，欠小孩的錢債。3.合夥虧錢。4.不利於同行競爭。5.還防晚運須儉約度日。也防意外、因果病（福德的六位沖一位）。6.",
      "福德": "1.多為子女操心。或子女不盡如人意、沒出息。也防己身小器量。2.也防子女亂花錢。3.合夥難成事或合夥虧錢。4.但防老來有憂、晚境自憐。5.6.子息緣薄或少子息。子福較薄。7.性生活不美滿，性能力差（桃花星）。8.格局佳，有懂事、善體人意的思想早熟子女。",
      "遷移": "1.子女在遠方。2.小孩常不在身邊或子息虛寒。3.子女憨厚或小孩成就差。4.最容易有出息的小孩在外邊，沒出息的小孩在身邊。5.老運較差，養兒未必能防老。6.合夥難成事或合夥緣不長久。7.格局差，防意外、業力病〈雙忌以上〉。宜多種福田。"
    },
    "科": {
      "夫妻": "1.再婚仍與元配往來。2.外遇物件與配偶認識。",
      "父母": "1.小孩書香味、教養好。2.子女清秀乖巧。",
      "兄弟": "1.性生活有情趣。2.小孩有計劃性的理財。",
      "田宅": "1.小孩秀慧、乖巧，少惹麻煩。",
      "交友": "1.子女朋友不多，但多君子益友。",
      "事業": "1.可從事小孩的文教用品、事業。",
      "命宮": "1.子女文質，可培養子女書香氣。",
      "疾厄": "1.書生型的小孩、教養好、有規矩。",
      "財帛": "1.小孩收入有限。2.子女理財有計劃。",
      "福德": "1.小孩好的書香氣息、精神素養。",
      "遷移": "1.小孩文秀。小孩教養好、在外好名聲。"
    },
    "祿": {
      "夫妻": "1.容易因孕而婚。2.性生活較美滿。3.親戚關心〈促成〉我的婚姻，或有表兄妹親上加親的婚姻〈子女為親戚位〉。4.合夥賺錢（祿照事業）。（注",
      "父母": "1.小孩嘴甜、有禮貌，甚是討好。2.子女成績好、師長緣好。3.子女聰明但防唸書未盡全力。",
      "兄弟": "1.小孩出生之後收入變好。2.子女收入多、經濟好。3.子女體質好，健康平順。4.合夥賺錢。5.畫眉樂。",
      "田宅": "1.子女蔭家、小孩經濟有成、子女置產、成家立業。子息旺家。2.多子息〈多生兒子〉、相處融洽、少代溝。天倫樂。可以三代同堂。3.4.親戚多往來。5.可從事托兒所、幼稚園。做小孩的生意。",
      "交友": "1.能與子女的朋友打成一片。子女親近我友。2.子女親近配偶。我亦容易有忘年之交。3.子女人緣好，受誇讚。4.性生活美滿〈桃花星〉〈子女─疾厄的福德宮〉。5.合夥防中看不中用。",
      "事業": "1.合夥緣好、合夥興隆。2.子女工作如意。3.離家出外有錢賺。4.適合做小孩子的生意。",
      "命宮": "1.容易子息緣旺，子女也多有出息、享子福。子女孝敬我。2.子女個性通情達理。子女親近我。3.可做小孩子的生意，適合幼教、托嬰、兒童用品。適合向外求財（子女-田宅之外）。4.親戚多往來（子女-婚姻而來的親戚位）。5.合夥佳，會賺錢。6.晚運吉祥。容易逢凶化吉（子女-福德的共宗六位）。7.驛馬，除外有錢賺。適合跑業務，四方有財。8.性生活較美滿，也防桃花外遇（桃花星）。（注",
      "疾厄": "1.小孩緣好、子女親近我。2.有會撒嬌的小孩。3.4.容易桃花入身〈桃花星〉。",
      "財帛": "1.小孩的收入好、會賺錢〈但不一定會富有〉。2.子女金錢孝敬我。3.合夥會賺錢。4.出外有錢賺、四方有財〈子女─驛馬位〉。5.6.適合做小孩子的生意，幼教、托兒、嬰兒用品生意。",
      "福德": "1.享子女福、喜歡小孩，與子女打成一片。子女平安順從，少得操心。子女貼心。2.3.性生活愉悅〈桃花星〉。4.晚境無憂、天倫有樂。5.遇難呈祥、壽相。晚景優。6.合夥賺錢。7.親戚往來熱絡〈子女為親戚位〉。",
      "遷移": "1.小孩外緣好。容易生兒子。2.子女教養好，受歡迎、多好評。3.兒女多有出息。因子女而榮顯。4.子女順遂，無須我操心。兒孫蔭我。5.屬下素質好。親戚有榮顯者。6.合夥緣旺，合夥佳。7.可以桃李滿天下。也容易遇難呈祥。"
    },
    "權": {
      "夫妻": "1.容易俸子成婚。2.小孩成就好〈權照事業〉。3.合夥容易有成。",
      "父母": "1.2.格局好，小孩聰明善讀書。",
      "兄弟": "1.小孩有出息。小孩長大助我經濟。2.子女體質好，健康少病。3.性生活宜節制，小心掩苗助長、防油盡燈枯。",
      "田宅": "1.格局好，小孩能幹，擴張產業、光宗耀祖。子女成就家庭。子女獨立。2.格局差，子女家中占權，還防爭產、不睦（加忌尤顯）。",
      "交友": "1.2.合夥防中看不中用。",
      "事業": "1.合夥有成就。也適合向外求財。2.子女能力好、事業心強。3.同行競爭壓力。",
      "命宮": "1.子女個性強、有主見。格局好，子女能有成就。2.格局差，子女難教，防出叛逆子（加忌",
      "疾厄": "1.小孩好動，容易跌撞。2.子女健康。3.性生活宜節制，小心掩苗助長，油盡燈枯。",
      "財帛": "1.小孩能力強、收入高、會賺錢。2.3.適合做小孩子的生意。4.同行競爭壓力。也適合向外求財。5.合夥佳。",
      "福德": "1.格局差，防子女的自恃、傲慢，難管教。2.格局好，子女個性獨立、上進。3.合夥賺錢。",
      "遷移": "1.子女有能力強者。2.格局好，小孩獨立、有出息。格局差，但防青少年期的叛逆不好教。3.下屬得力。4.合夥有成、蒸蒸日上。"
    }
  },
  "夫妻": {
    "忌": {
      "子女": "1.配偶疼子。2.3.婚後宜小家庭。",
      "父母": "1.同居無名份。2.3.夫妻不同戶籍。4.5.配偶太過顧外〈夫〉家。6.格局好，配偶孝順、配偶好學不倦。格局差，配偶喜怒形於色、配偶耐性差。7.婚後宜小家庭。",
      "兄弟": "1.配偶勤儉守分，男命多娶職業婦女。2.各自忙碌、婚姻相處時間少、少畫眉之樂或草率房事〈沖婚姻共宗六位〉。3.兄弟各自婚後手足情漸淡。婚後也容易朋友較少往來。兄弟各自婚後不宜家族共同事業。4.婚姻倦怠症候群〈沖婚姻共宗六位〉。",
      "田宅": "1.配偶雖不善情趣，但勤儉顧家。2.婚後適合獨立小家庭。3.少妄想齊人之福，一山不容二虎。4.慎防桃花敗產。",
      "交友": "1.配偶個性惜情重義，胳臂往外彎。2.3.配偶干涉我的交友，婚後朋友變少。",
      "事業": "1.配偶事業心重。男命容易娶職婦。2.3.夫妻最好不要共同的工作，否則須防多意見、口舌（夫妻忌出-配偶個性快直）。4.容易是挑戰性或吃力不討好的工作（象義等同於遷移忌入命）、5.勿賭、少投機。",
      "命宮": "1.配偶固執、不好溝通或處處干涉、緊迫盯人。婚姻需多容忍包涵。2.欠債的婚姻〈感情〉，或配偶諸多乖違〈譬如健康問題、破財〉、過錯甚或外遇（桃花星）問題，帶來極多惱苦。3.或有婚後個性反而漸收斂而不活躍〈忌沖遷移〉。4.只宜晚婚。〈心智較成熟，問題會較少〉。5.防感情劫、桃花債。6.勿賭、投機，沒有不勞而獲。",
      "疾厄": "1.配偶勤快、閒不住。2.3.或配偶〈異性〉很黏人、跟屁蟲，戀愛時形影不離，婚後緊迫盯人。",
      "財帛": "1.貧賤夫妻百事哀、防婚姻多爭或相處冷淡。但防相厭。2.相欠債的婚姻（因果論）、防溝通不良、相處沒有味道。3.婚後宜謹慎理財，以免為財傷情。4.不宜共同事業，以免多爭不相讓。5.不宜賭、投機。6.很容易桃花破財、桃花債。少有齊人之福。",
      "福德": "1.惡緣的婚姻〈感情〉。欠婚姻〈感情〉債（宗教的因果論）。2.配偶〈異性〉執迷所欲難溝通。3.格局差，婚姻〈感情〉帶來極大痛苦、乖違、迷亂等傷害，甚或生離死別。4.勿賭、投機〈夫妻─福分財，不厚〉。沒有絲毫的不勞而獲。防少小也多災。（注",
      "遷移": "1.配偶耿直、憨厚。不善營造氣氛、少了情趣的婚姻。或苦恨年年壓金線。2.己身異性緣非佳，也不善表達感情。3.4.勿賭、投機。防少小多災。"
    },
    "科": {
      "子女": "1.親戚介緣的婚姻。2.配偶文明的教導小孩。3.容易二婚〈或桃花〉與配偶舊識或有往來聯繫。",
      "父母": "1.配偶文質、秀氣。2.長輩介緣的婚姻〈福德科入父母同論〉。",
      "兄弟": "1.婚後仍可能與婚前情緣搭上線。2.婚後理財量入為出。",
      "田宅": "1.配偶善持家，有條不紊、乾淨雅適。2.婚姻可能介緣于家人或鄰居。",
      "交友": "1.2.重視感覺的婚姻生活。3.",
      "事業": "1.適宜細水長流的銷售方式。2.姻緣容易來自於職場的相識。",
      "命宮": "1.配偶有氣質。情斷緣未了。",
      "疾厄": "1.感情優柔、含蓄〈加祿則羅曼蒂克〉。輕聲、溫柔。2.緣斷情未了、藕斷還絲連。",
      "財帛": "1.婚姻平實、精神契合、淡中有味。",
      "福德": "1.異性〈配偶〉悠悠柔情。加祿",
      "遷移": "1.配偶秀慧于外。2.婚姻好名聲。"
    },
    "祿": {
      "子女": "1.配偶與小孩能打成一片。配偶對子女管教放任。2.配偶喜歡小孩，容易結婚即孕或因孕而婚。3.妯娌間好相處〈子女為兄弟的夫妻宮〉。4.我容易婚外情〈桃花星〉。5.配偶驛馬，喜歡往外跑。6.",
      "父母": "1.配偶長輩緣好，配偶脾氣好、開明。配偶明亮討喜。2.未婚者的感情喜悅形色，或為婚期近矣〈父母─婚姻的田宅〉。3.善於感情的表達。看起來很適配的婚姻。4.名正言順的婚姻。被祝福的婚姻。4.少有婆媳問題。婚後可與長輩同住。5.婚後仍有唸書緣。",
      "兄弟": "1.配偶量大，與我兄弟亦好相處。2.配偶財力好。或婚後經濟佳。3.感情緣容易早發〈第二大限即得緣〉。4.閨房畫眉樂。5.妯娌相親近（兄弟-婆婆、妯娌的福德）。也少婆媳問題。6.一生衣食豐足〈夫妻者福德的財帛，祿之于兄弟庫位，經濟無乏〉。7.逢偏財星，發財甚速（會權尤佳）。",
      "田宅": "1.結婚成家、也容易置產結婚。2.婚姻生活愉悅。婚後經濟平穩順暢。3.配偶量大容易相處，但未必顧家。4.配偶蔭家、得妻〈夫〉財、容易配偶有財產。5.婚姻、置產兩相近或配偶相助置產。（結婚是否置產仍舊需以田宅所化為衡量準繩。）6.異性助我生財。異性親近我生活圈。7.但防容易異性介入家庭、隱含雙妻〈夫〉格（桃花星）。8.少小即家境不惡，一生衣食豐足〈夫妻者福德的財帛，祿之于田宅庫位，一生有福〉。9.逢偏財星，發富甚速。常見發財也發桃花。",
      "交友": "1.配偶人緣好、開明識大體。2.婚後反而廣增人際緣。3.出雙入對，只羨鴛鴦不羨仙。4.被眾人祝福的婚姻，幸福的婚姻生活。5.",
      "事業": "〈夫妻祿出〉1.婚後事業順遂。配偶〈異性〉助蔭我事業。2.異性合作事業佳、異性客戶或異性員工緣好。3.四方有財。宜加強公關、業務、文宣、廣告。也宜進口生意。4.特種營業〈偏財星〉。5.",
      "命宮": "1.獲婚姻〈異性〉福。配偶賢良。配偶不固執、好溝通。婚姻（感情）協調。2.異性緣好（但防劈腿、外遇）。情〈婚〉緣早發。3.婚後諸事順遂。婚後運氣轉好。4.外遇多能紙包得住火〈有福〉。5.格局差，當小白臉也容易混吃喝。格局好，雙妻命，得妻財、妻助、異性助。6.做業務，多找異性物件為客戶。異性合夥亦佳。異性的上司、下屬、員工多較好。7.一生衣食無憂、金錢不虞匱乏。逢偏財星，中獎、意外財（夫妻-福分財）。9.少小運限平妥〈第二大限前所有年歲〉。",
      "疾厄": "1.配偶〈異性〉體貼，或對方較多情溫柔。婚姻生活悠閒。2.異性緣好，久處容易生情。3.容易一夜情〈桃花星〉。4.配偶少干涉行動自由。配偶好相處。5.婚後容易發胖，可能也較懶散。我婚後也容易身體發福。6.逢偏財星，發財甚速會權尤佳。",
      "財帛": "1.美滿良緣、相敬和樂，好姻緣，善緣之婚〈婚姻對待關係好〉。2.配偶不計較金錢。婚後賺錢順遂。3.異性客戶討好、異性多助，容易獲異性財。4.可從事營造業、房產仲介〈偏財星〉、寢具、家電用品、傢俱〈夫妻宮為田宅共宗六位〉，婚友社。5.特種營業、娛樂界〈桃花星〉。6.逢偏財星，中獎、意外財（會權尤佳）。7.一生金錢不虞匱乏，逢山窮水盡也都柳暗花明。",
      "福德": "1.婚姻〈異性〉讓我幸福，美眷良緣、美好姻緣。幸福婚姻（祿照對待為，善緣之婚）。2.獲異性福。婚後諸事如意。3.容易一馬雙鞍的享齊人之福〈桃花星〉。4.逢偏財星，容易中獎、意外財、橫發。5.福厚衣食豐足、金錢少憂、少小少災。",
      "遷移": "1.配偶外緣好。令人稱羨的合諧婚姻，只羨鴛鴦不羨仙的感情。加科"
    },
    "權": {
      "子女": "1.配偶對子女教子有方或管教嚴格。",
      "父母": "1.格局差，防配偶傲慢無禮、得理不饒人。2.格局佳，配偶善讀書或見多識廣。3.4.婚後可以獨立小家庭。",
      "兄弟": "1.配偶能幹、有作為、善理財。2.配偶健康、活力。3.婚後金錢、事業多順遂。4.一生衣食無憂。5.6.逢偏財星，發財甚速（會祿尤佳）。",
      "田宅": "1.配偶善持家〈格局差-配偶家中占權〉。2.結婚很容易置產。婚後賺錢較順。3.逢偏財星，發財甚速（會祿尤佳）。4.少小家境不惡。一生衣食無憂。",
      "交友": "1.體面的婚姻。2.配偶干涉、篩選我的交友。3.配偶在朋友間占權。配偶雞婆愛現人。4.婚後交往多有成就的朋友。",
      "事業": "1.配偶能幹有成就、配偶〈異性〉成就我事業。異性員工助力好。2.最適合專技、專利等獨門事業或建立品牌。（事業的遷移化權入事業，外權入於內）。3.婚後有助於創業，婚後事業更順。4.適合先成家後立業。5.",
      "命宮": "1.配偶有主見〈婚姻需多包容〉。六親化權入命為主見，化權入遷移為能幹。2.異性成就我。婚後較能有成就。3.一生衣食無憂（夫妻-福分財）。4.逢偏財星，中獎、意外財。",
      "疾厄": "1.配偶〈異性〉健康、活力，戀愛時對方較主動、熱情。2.配偶干涉（主導）行動。3.配偶健康多動，個性粗線條、乾脆。4.逢偏財星，發財甚速會祿尤佳。",
      "財帛": "1.配偶掌錢〈權〉。配偶賺錢能力好。2.配偶〈異性〉成就我賺錢。婚後收入較好。3.可從事營造業、房產仲介〈偏財星〉、寢具、家電。4.逢偏財星，投機、意外財（會祿尤佳）。",
      "福德": "1.配偶好勝心強，可能婚後物質生活，容易奢華浪費。2.戀愛多對方主動。3.婚後財運較佳。4.逢偏財星，容易中獎、意外財、橫發。5.容易衣食豐足、金錢少憂。",
      "遷移": "1.配偶能力強，獨當一面。2.婚後較能有作為。3.婚後容易置產〈夫妻為田宅的共宗六位〉。4.逢偏財星，中獎、意外財。橫發。5.容易一生豐足、金錢少憂。"
    }
  },
  "父母": {
    "忌": {
      "子女": "1.長輩疼小孩。祖疼孫。2.我對小孩教養不得要領、疾言厲色或我形象非好榜樣。",
      "夫妻": "1.長輩煩惱我婚姻。2.3.不正常、問題的婚姻關係。〈注",
      "兄弟": "1.2.3.我有銀行貸款。4.防契約、文書破財。5.外〈夫〉家經濟不佳。",
      "田宅": "1.父母辛苦過來者。2.長輩為我家庭操心。3.必須盡孝養之責。4.長時間的銀行貸款。5.格局差，宗族固陋文風衰。6.外〈夫〉家儉約。",
      "交友": "1.2.長輩關心（干涉）我的人際交往，長輩能庇蔭我的人脈資源有限。還防己身修養差，言辭慳吝。3.不利考試、競爭。4.格局差，防交亂花錢的損友，或機身修養不好，造成形象不佳、不討好。",
      "事業": "1.長輩執著工作、敬業、工作穩定。2.長輩操心我工作。也防合約牽絆、礙事。3.長輩〈上司〉加諸我的工作壓力。4.須幫父母分憂解勞。也須盡孝養之責。5.6.外〈夫〉家辛勞。",
      "命宮": "1.須盡人道孝養之責（或謂之欠父母債）。2.父母曾辛苦過來或曾受過挫折、災病（業力之纏）。3.容易有長期性的銀行貸款（忌入命）。4.少與人金錢借貸往來，防被倒帳。不可幫人作保、背書，小心支票、互助會。也防文書困擾（父母-文書宮、交友財）。5.外〈夫〉家家運不強。6.格局差，腦筋不好、唸書辛苦、自食其力的半工半讀，或不愛念書。7.小孩工作忙碌或為上班族。",
      "疾厄": "1.不愛唸書。討厭繁文縟節、不喜歡中規中矩、被束縛。2.3.4.小心文書問題纏身。5.",
      "財帛": "1.也可能父母缺錢（格局差）。2.3.人欠我金錢，容易借大還小或拖拖拉拉。也防合約、文書牽絆、傷財。4.謹慎簽合約。5.少用支票為上（父母-文書宮）。6.7.外〈夫〉家家境清寒。8.婚後宜獨立小家庭（父母-夫妻的田宅、財帛-父母的疾厄）。（注",
      "福德": "1.不愛唸書、望文興歎。拙於學習。考運不佳。2.長輩執著所好或父母多慮、代溝。3.外〈夫〉家家道不興。4.婚後宜小家庭。5.少與人金錢借貸往來、互助會，以免被倒賬吃虧。6.",
      "遷移": "1.或長輩緣較差（沖命）。2.本身學歷不好或歷練、表達能力不佳。立足於社會的條件較差。木訥、嚴肅不利己。3.少轉圜。4.不利於唸書、考試〈關鍵大考常出狀況〉。也拙於學習。觀察不入微。5.外〈夫〉家不旺。"
    },
    "科": {
      "子女": "1.對子女言教，民主式、講道理的教養。",
      "夫妻": "1.縱令分居也名份未除。",
      "兄弟": "1.與人金錢往來不多。2.借錢予人，常整筆借出，分期收回。3.宜精緻產品文宣廣告，提升知名度。",
      "田宅": "1.書香繞宅。長輩民主。家中容易佈置書、畫品。2.家中少有爭吵吼嚷。",
      "交友": "1.長輩多君子交。2.我文、禮會友，君子交。形象好。防矯柔作飾。",
      "事業": "1.文宣、廣告。2.在職進修。",
      "命宮": "1.2.我個性平和，涵養可以與日俱增。",
      "疾厄": "1.修養好，心境悠然。",
      "財帛": "1.2.我計劃性理財、凡事量力而為。",
      "福德": "1.學智近慧，可移情轉性。2.",
      "遷移": "1.修養與日俱增，端莊樸實。2.我形象佳、名聲好。3.長輩形象好。"
    },
    "祿": {
      "子女": "1.長輩慈愛，祖孫關係好。長輩寵小孩。2.我好言辭、文禮、形象的教導。3.子女容易遇到好師長。",
      "夫妻": "1.長輩的婚姻合諧。2.3.婚後可與長輩同住。4.長輩促成、外〈夫〉家呵護的婚姻。5.名正言順的婚姻。",
      "兄弟": "1.長輩經濟好、健康狀況佳。2.3.4.信用好、與銀行多金錢往來。5.外〈夫〉家經濟好。6.利於唸書、考試。常學為所用。7.加強形象廣告，利於銷售。",
      "田宅": "1.2.家教民主。3.或宗門長輩多往來。4.長輩幫助置產、助我生活所需。5.6.家族曾出有學問者。或文風入宅。7.親家、姻親多往來。",
      "交友": "1.長上人緣好。2.父母友我之朋。3.容易交往較年長或涵養好的朋友。4.喜歡說圓融好話。外表、形象也容易光鮮亮麗、和悅親人。5.格局差，防阿諛奉承、虛偽讚歎。",
      "事業": "1.長輩、上司關心、提攜我。2.利於證照、就業、升遷等考試，也利於公職。3.利於接洽公家機關業務，也利於長輩對象的生意。也適合文化工作者。4.學以致用。高學〈經〉曆可以高薪、高職。5.外〈夫〉家家運好。父母工作如意。",
      "命宮": "1.得父母蔭、有長輩緣。父母開明。2.聰明、利於學習，可以見多識廣。也利於唸書、升遷、證照等考試。與公職較有緣。3.少文書困擾〈父母宮為文書宮〉。4.最宜做長輩客戶生意。容易長輩（長官）提攜。遇到好長官、上司。專業涵養可生財。5.或有忘年之交。6.外〈夫〉家家境好。婚後可與父母同住。7.小孩事業順利。",
      "疾厄": "1.善於自我調適。2.我長輩緣好，長者親近、容易與長輩相處。3.修養入佳境，心境放下、輕鬆。也合適從事文化工作。4.周轉方便、調度容易。",
      "財帛": "1.信用好，借貸容易。或參與互助會。2.與銀行多往來（父母宮-銀行）。3.父母資助我錢財。4.利於唸書、考試。5.外〈夫〉家經濟好。6.子女工作上賺錢順暢（父母-子女的事業）。7.利於從事現金生意、四方來財。金錢調度方便。",
      "福德": "1.2.與長輩投緣、天倫多趣，得長輩福蔭。或思想成熟，長輩愉悅。3.聰明樂利，利於學習〈但防自我要求不高〉。宜多讀聖賢書，樂智利慧。也善於自我調試。4.適合公職。利於念書、考試。5.外〈夫〉家和樂。6.喜歡聽好聽的話。",
      "遷移": "1.也容易遇上好長官。2.容易與長者或德高望重者交遊。3.容易遇上聞達、善袖舞的長輩〈長官〉。4.格局佳，修養內涵好、禮貌、形象佳、含和溢表、端莊親和。也善於自我調適。格局差，防虛言偽飾、表裡不一。5.岳〈翁〉家顯榮於社會。6.格局佳，學〈經〉曆好、世故練達，能創造立足社會的好條件；容易高職、高薪。7.利於唸書、升學、證照等考試。利於公職、升遷。也適合文化工作者、慈善事業。8.記性特佳，可以見多識廣。"
    },
    "權": {
      "子女": "1.盡責教養〈栽培〉小孩。但防習慣性訓誡。2.子女遇到嚴格的師長。",
      "夫妻": "1.2.3.外〈夫〉家成就好，外〈夫〉家成就我〈權照事業〉。4.也容易是公證結婚（加忌尤顯）。",
      "兄弟": "1.2.3.我信用好大筆銀貸或長輩助我經濟。4.利於唸書、考試。5.外（夫）家經濟能力佳。",
      "田宅": "1.長輩家教甚嚴。2.3.4.家族中長輩活耀。5.長輩成就我財富或幫助我置產。6.高額貸款置產。7.家族曾有公門當官者。8.外〈夫〉家境好。",
      "交友": "1.長輩約束我的人際交往。2.3.我或有術德皆好的忘年之交或我術德誨人。4.但防己身修養差，說話臭屁、占上風。",
      "事業": "1.2.長輩提攜〈成就〉我。3.利於證照、就業等考試。利於公職。4.學以致用、學有專精、高學〈經〉曆，可以高薪、高職位。5.外〈夫〉家家運強。6.利於強力廣告促銷。",
      "命宮": "1.2.父母〈長輩、長官〉的提攜。專業涵養利於立足社會。3.外〈夫〉家家境好，成就（助）我。4.利於唸書、就業、升遷、證照等考試，也利於公職。5.小孩事業有成。（注",
      "疾厄": "1.2.我抗壓性高、意志力強。3.讀聖賢書，守為分明。",
      "財帛": "1.父母約束我的金錢。2.信用好，容易大筆金錢往來。3.委託金融理財。4.外〈夫〉家經濟強。子女事業賺錢。5.利於念書、考試。6.利於高格調、高價位的銷售。",
      "福德": "1.長輩期望高。父母愛面子。2.格局佳，求知欲的滿足。格局差，空談大話、好高騖遠的自我期許。喜歡別人奉承。3.聰明，利於讀書、考試。4.利於公職、升遷〈考試〉及專業證照取得。",
      "遷移": "1.2.利於唸書、考試、公職、升遷、證照取得。3.高學〈經〉曆、學有專精，容易受長官〈上司〉拔擢高遷，也容易高職、高薪。4.岳〈翁〉家活耀於社會。5.格局好，術德兼修，可以德高望重。格局差，說話臭屁占上風、出言傲慢、說大話。"
    }
  },
  "兄弟": {
    "忌": {
      "子女": "1.兄弟宜各自獨立門戶。兄弟不同心協力。2.庫漏、存不了錢、不善理財。格局差，防負債、事業萎縮（庫位忌出）。3.格局差，人生多起伏、難守成、變動大。收入不穩定。4.5.6.房事草率，閨房少樂。",
      "夫妻": "1.婚後兄弟各顧自家。兄弟執于感情。2.婚後宜獨立門戶。3.4.容易投資失利，宜上班安穩（事業的六位沖一位）凡事也容易好景不常。",
      "父母": "（退敗象）1.兄弟孝順或兄弟喜怒形於色。2.我經濟支出大、不善理財。格局差，防入不敷出、負債。3.格局差，人生多起伏、難守成、變動大。4.格局差，防會款、銀貸、借貸的壓力。5.小心予人金錢往來，防借錢予人被倒賬。",
      "田宅": "1.2.兄弟儉約，常非長子格，防手足情淡，助力不大。3.儉約、儲蓄、逐漸累積。格局佳，可以積沙成塔。4.需一步一腳印，儉約起家。5.容易是上班族或勤儉起家。",
      "交友": "1.退財、冷破、少積蓄、入不敷出、不善理財（庫位忌出）。2.格居差，還防負債累累。人生多起伏、難守成。須謹慎行事，小心投資。3.很容易遇到無義的朋友，借錢予人難收回。也防內神通外鬼。4.健康下滑，注意養生、運動。5.",
      "事業": "1.兄弟有敬業者。2.最好上班安定，或現金、無囤貨的小本生意，或從事技術、仲介、顧問、會計、代書等服務業。3.須謹守本分、守成收斂。一步一腳印。否則常時不予我、用兵之罪。4.不可投資回收慢的事業。也不宜從事生產行業。",
      "命宮": "1.容易是長子拉拔兄弟，或非長子而為兄弟所累。2.也防家運不濟或理財欠妥。不可投資生產行業（財庫小）。3.宜精打細算、謹慎理財並開源節流。須儉約、耐勞。辛苦起家。4.最宜上班安定或小本經營。或從事不囤貨不壓本的技術、仲介、顧問等服務業。5.女命易為職業婦女。6.人生需盡責、多勞，但宜注意養生。",
      "疾厄": "1.兄弟勤勞或我為兄弟所累。2.手足不親，各顧自家〈六親忌入田宅三方不免顧自而少情〉。3.我工作忙碌、過勞，少得替代幫手。4.格局佳，也是粒粒皆辛苦。還防多耗、支出大。",
      "財帛": "1.常時運不濟或理財欠妥。也有長子格。2.3.格局差，防人生多起伏、難守成。4.最宜上班有固定收入。或從事不囤貨壓本的技術、仲介、顧問。會計、代書等服務業。5.6.健康走下坡〈身體的氣數位沖福德〉。7.或兄弟賺錢不易，收入有限。8.不可以投資回收慢的事業。也不適合從事生產行業。",
      "福德": "1.兄弟有重享受者。2.3.庫漏難蓄、經濟退散，無法守成（退敗象）。也防事業下坡，經濟蕭條。4.長時間的健康下坡，唯宜養生、運動。5.",
      "遷移": "（兄弟忌出）1.兄弟有憨厚、成就不高者。兄弟少助力。2.我不善理財、收入差或支出重，經濟頹廢、投資敗財，甚或窘態畢露。格局差，人生多起伏、難守成、收入不穩定。3.適合上班安定或不囤貨、不壓本、少風險的仲介買賣、技術服務、專業顧問、現金小本生意等。4.勿從事本大、回收慢的生產行業。容易好景不常。"
    },
    "科": {
      "子女": "1.理財量入為出。2.性生活重情調〈有節制〉。",
      "夫妻": "1.容易是青梅竹馬，或有因同學、同事的久處生情而得婚〈福德科同論〉。",
      "父母": "1.理財作帳，量入為出。2.喜歡分期付款的支出。3.宜重視產品精緻包裝。",
      "田宅": "1.兄弟淡處〈不失禮儀〉。2.經濟平妥、計劃性理財。",
      "交友": "1",
      "事業": "1.宜做好企劃管理、謀定而後動。",
      "命宮": "1.理財、經濟平妥、細水長流財。2.病痛得貴人。3.兄弟文質。",
      "疾厄": "1.手足情淡〈不失禮儀〉。2.兄弟文質之身。",
      "財帛": "1.理財、作帳。量入為出。",
      "福德": "1.涓涓滴流，不無小益。2.兄弟恬淡優遊。",
      "遷移": "1.理財記帳、收支平衡。2.企劃管理。"
    },
    "祿": {
      "子女": "1.兄弟喜歡寵小孩。2.我經濟好、平常多支出、少有理財觀念（庫位祿出）。3.給小孩零用錢充裕。4.健康好，性生活美滿（桃花星）。5.小孩喜歡往外跑、小孩樂天（兄弟-子女的福德）。6.有機會合夥〈未必為吉〉。",
      "夫妻": "1.兄弟對異性多情。或兄弟婚姻平順。2.兄弟和我事業、賺錢都順遂〈祿照事業〉。3.妯娌相親近。4.少婆媳問題。5.長久的體質狀況好（兄弟-身體運、夫妻-疾厄的田宅）。6.可從事生產行業（偏財星會權尤佳）。",
      "父母": "1.兄弟甜嘴，討好，容易得長輩歡欣。2.兄友弟恭〈也許僅止於作表面〉。3.兄弟有學業佳者。4.我經濟寬裕、信用好。5.體質好，神清氣爽（父母-形于色）。6.最易注重信譽及產品形象（形于外宮）。",
      "田宅": "1.兄弟和睦、手足情濃，少有計較。2.事業越做越順。產業、財富蒸蒸日上。3.經濟日增，可以陸續置產〈增進象〉。4.容易是長子格（兄弟少擔家庭責任）。",
      "交友": "1.兄弟有人緣佳者。2.善攀機緣，多往來交易。3.經濟好，平常支出多（庫位祿出）。4.適合人潮生意，也適合流行、時尚、休閒用品的事業。5.適合批發、大賣、直銷的生意。",
      "事業": "1.兄弟事業順暢、手足有情、兄弟蔭我。可從事家庭事業。2.資金充足、周轉順暢、可以迴圈營利。可以從事生產行業會偏財權尤佳。3.4.兄弟工作順心，與兄弟合夥或家庭事業佳。5.生活條件優渥。享受現成。",
      "命宮": "1.兄弟順遂，兄弟通情達理、手足情深、兄弟是我福。2.我亦事業平順、豐衣足食、經濟不虞匱乏。格局好，資金足而生意越做越大。3.家庭生髮，收入好、周轉方便。4.生活條件優渥、享受。但防養尊處優。5.體質好、畫眉樂。6.利於高薪、分紅薪水。也可以創業，會權尤佳。7.母緣佳，與子女相處和樂。",
      "疾厄": "1.手足情濃、兄弟多聚、投緣、好商量。2.經濟裕如、手頭方便、賺錢輕鬆。適合做生意、共同經營家庭事業或開店營利。具長子象，但防兄弟有好逸者。3.體質健康、少病痛。4.物質生活好。",
      "財帛": "1.兄弟有經濟好者。兄弟是我福，兄弟與我有通財、少計較。2.我經濟好、手頭方便（非必自己賺得）。生活條件優渥。享受現成。3.適合現金生意，周轉變現快。4.但防少理財計畫而多花用。5.物質生活好。",
      "福德": "1.兄弟樂天知足、也手足情濃好相處。2.經濟裕足、事業平順、賺錢輕鬆、物質生活優渥。長子象（兄弟樂天少責任）。3.家庭收入好、衣食豐足。4.健康平和少病。體質好，也容易病逢貴人。5.可從事生產行業（偏財星）。",
      "遷移": "1.兄弟社會關係好、財力足，兄弟也多如意。2.我事業順遂、經濟裕如，實力、信譽、地位皆彰顯〈遷移為兄弟的共宗六位〉（兄弟宮佳者，通常社會地位亦好）。3.周轉方便，信用良好。善理財者，可以錢滾錢。4.善用廣告、文宣、媒體，容易助長業務、開發商機。5.好口碑，適合推展業務、銷售，也利於創業、升遷。6.健康、愉悅、如意、吉祥。7.昆仲、岳〈翁〉皆顯榮於社會。8.兄弟緣旺（多），手足和睦。9.可從事生產行業（偏財星會權尤佳）。"
    },
    "權": {
      "子女": "1.兄弟嚴以教子。2.我經濟好、大筆支出（庫位權出）。3.經濟成就子女、給小孩零用錢慷慨。4.健康好，性能力強。5.有能力成就合夥。",
      "夫妻": "1.兄弟有作為，兄弟容易創業。2.我容易有作為〈成就位化權照事業〉。可從事生產行業（偏財星會祿尤佳）。3.",
      "父母": "1.兄弟有無禮、傲慢者。2.格局好，兄弟有學業佳者。3我經濟能力好、容易整筆支出、信用好。事業上可以強化產品廣告宣傳。",
      "田宅": "1.善經營，錢越滾越多、事業越做越順（增進象）。2.兄弟擴張產業、還防兄弟霸氣爭產。3.經濟強勢，購屋置產、蒸蒸日上〈增進象〉。4.兄弟占權，非長子格。",
      "交友": "1.善於掌握、創造商機。2.經濟能力好，大筆錢支出（庫位權出）。3.兄弟有好勝、強出頭者。4.可從事批發、大賣、專業、開發，領先潮流、創意時尚等生意。",
      "事業": "1.兄弟有成就者、兄弟助我。2.資金充足、投資擴張。3.兄弟有能力佳者，可與兄弟合作事業或家族事業。可從事生產行業（會偏財祿尤佳。4.利於升遷、創業。5.重物質生活。",
      "命宮": "1.兄弟有能幹者。2.昆仲不居長，兄弟掌權、兄弟成就我。3.體質較好、活力、朝氣。小病少。4.經濟實力佳，事業水漲船高、資金越滾越大。5.利於升遷、開創、具老闆格。6.重物質生活。",
      "疾厄": "1.兄弟體壯、個性粗線條。2.我工作耗體力、活動量大。3.抗壓性高，越操越健康。4.5.可以經營家庭事業。",
      "財帛": "1.兄弟有賺錢能力強者。2.我經濟能力好、手頭方便。容易大筆錢進出。也可以高薪、高職。3.家庭經濟好。如能善理財，錢滾錢。4。周轉變現快，很適合現金生意。5.重物質生活。出手闊。防奢侈浪費。",
      "福德": "1.兄弟有好勝、愛體面或奢華浪費者。2.經濟強、家庭收入好、事業多順。3.積極、幹勁，敢賺敢花、物質生活高檔。4.健康、活力體質強。5.可從事生產行業（偏財星）。",
      "遷移": "1.實力強、財力厚，容易獲致社會地位。可從事生產行業（偏財星會祿尤佳）。2.健康、活力、積極、開創。3.縝密於行銷策略、廣告宣傳，收穫必多。4.善理財者，錢滾錢。5.信譽、品牌、專業、技術最可取勝。6.昆仲、岳〈翁〉皆活耀於社會或成就高。7.利於創業、升遷。〈注"
    }
  },
  "田宅": {
    "忌": {
      "子女": "（忌出、退敗象）1.格局差，小孩需分擔家計。父債子償。2.我在家呆不住。3.供給子女教養有限或不得要領。4.經濟危機。格局差，人生多起伏、難守成（忌出）。5.6.但防好景不常，最宜守成安分。",
      "夫妻": "1.婚後不宜大家庭，獨立門戶免紛擾。2.配偶分擔家計。胼手砥足的持家、置產。3.夫妻相處時間宜少〈多則相懨〉。4.5.少作投機性的投資（福分財不厚）。6.宜上班安穩。（注",
      "父母": "（退敗象）1.退財、經濟不穩、少盈餘、甚或入不敷出。格局差，人生多起伏、難守成。2.與長輩難以久住、少能長久供養父母。家庭令長輩操心。或家業始終掌握于父母。3.拖欠銀行貸款。4.住所非戶籍地址。5.不宜名下登記不動產。6.7.8.婚後宜小家庭。9.但防好景不常，最宜守成安分。",
      "兄弟": "1.家境差，或兄弟承擔家計。非長子格。2.格局差，防兄弟營私、獨立門戶。3.終致家庭窮困。亟需加強理財。4.不適合店家合一。5.6.婚姻容易聚少離多或相處時間少（沖婚姻六位）。7.格局佳，也不免多耗、支出大。六親少助。",
      "交友": "1.人生多起伏。難守成。2.住所偏僻、人煙少。防寄人籬下。3.家庭（族）人氣不旺。防親不敦、鄰不睦，門前冷落車馬稀。防內神通外鬼。4.婚後宜小家庭（交友-婚姻的共宗六位）。5.但防好景不常，最宜守成安分。",
      "事業": "1.家庭的責任、負擔。有長子格。2.婚後最好離祖獨立，適合小家庭〈沖夫妻〉。3.適合安定的上班族。或小本經營的辛苦起家。也適合從事技術、仲介、顧問、會計、代書等服務業。4.宜店、家分開。小店經營。5.宜小本經營、現金生意、日用品、消耗品、雜貨、五金等家庭用品。6.婚姻宜相處時間少〈沖夫妻，少相處反為吉〉。格局差，夫妻分居。7.還防家運不濟或時不予我等挫折。不可以投資回收慢的事業。也不宜從事生產行業。",
      "命宮": "1.擔負家庭責任、欠家庭債，多勞、生活壓力。多家運不濟或理財欠妥。也容易家運蹇滯。2.多為長子〈或具長子個性〉，需要辛苦起家。可從事買賣業，不宜生產行業。3.家世不旺或有家道中落、常見家中成員平庸或少出息。也可能子息緣薄。4.不可以做回收慢的投資。5.置產靠己〈千萬量力而為，以免負擔過重〉。第一次置產容易買中古屋。不動產投機敗財。6.住宅舊、小或生活環境窒礙。防室內陰濕、髒亂，空氣不足、採光差。宜除舊佈新，以免家運惡性循環。7.固守為上，小心多投資多負擔（財庫小）。8.容易在家呆不住。9.宜上班安穩、或小本經營外，亟須開源節流、精打細算，也宜兼職、加班。10.適合從事技術、仲介、顧問、會計、代書等風險少的服務業。11.不動產登記自己名下者不宜貪多。12.女命擔家計，多為職業婦女。〈注",
      "疾厄": "1.生活環境窒礙。防家庭紛擾、家宅不寧。家運不強。住所宜加強採光及空氣流通。2.欠家庭債。生活忙碌、汲汲營營。多刻苦耐勞、勤儉起家、粒粒皆辛苦。3.不宜店家合一（疾厄-事業的田宅）。4.格局差，容易在家待不住。5.須儉約守成，也適合上班安定而後兼差、兼職。6.容易是長子。7.配偶容易有狐群狗黨的人際交往（田宅-夫妻的交友宮）。",
      "財帛": "1.多家運不及或理財欠妥。2.也有擔負家計的長子格。3.格局差，人生多起伏、難守成。4.最宜上班有固定收入。或從事不囤貨壓本的技術、仲介、顧問、會計、代書等服務業。5.宜精打細算、小心理財，防事業萎縮、投資敗財、財產退敗（退敗象）。6.置產千萬量力而為，還防房貸負債過重。7.少作不動產或生產行業的投資，容易虧錢。8.亟需開源節流，烙銘危機意識。9.不動產登記自己名下者不宜貪多。10.不可以投資回收慢的事業。",
      "福德": "1.居家環境差、或陽宅氣場欠佳。2.家宅不寧、退財、疾病、乖違諸事。也容易無法守成（沖財）。3.4.情緒不對、諸多煩心、容易在家呆不住。5.容易好景總是不長久、家運不濟。",
      "遷移": "1.身世差或防家道中落。2.容易搬遷、脫產、退財、耗散等人生多起伏、不守成、收入不穩定。3.不適合自己名下置產。不動產也緣較薄。置產應購中古屋較吉。4.房子舊、門面差。住所偏僻或住家環境窒礙、雜亂。5.6..門第名聲差，宗疏親離。7.凡事也容易好景不常，最宜守成安份。"
    },
    "科": {
      "子女": "1.家庭書香氣息、小孩濡染文雅。2.民主式教養。書香傳子。",
      "夫妻": "1.清靜恬悅婚姻、重視精神生活。",
      "父母": "1.住家環境恬靜、書香、幽雅。2.門第名聲好、宗親多雅士。書香家庭。",
      "兄弟": "1.家庭計畫理財、收支平衡。2.生活恬淡、簡約。",
      "交友": "1.家庭名聲好、往來相扶持。",
      "事業": "1.可從事代書、會計、財務管理工作。家裡喜歡擺裝飾品、書香物。",
      "命宮": "1.家庭平順，生活樸實、恬適。2.家庭書香氣息。",
      "疾厄": "1.生活環境恬適、高雅、清靜。",
      "財帛": "1.作帳、理財，量入為出。",
      "福德": "1.精神有托，書香、淡雅、整潔清靜。2.祖蔭不厚。祖上遺書香。3.家中少有吼嚷。",
      "遷移": "1.門第名聲好。2.宗門文風、書香家庭。"
    },
    "祿": {
      "子女": "1.財產蔭子孫。祖業傳小孩。2.容易不動產買賣。3.多外宿、搬家。換房子。4.家教不嚴謹，給小孩有自由的空間。5.可從事托嬰、幼教事業。",
      "夫妻": "1.置產結婚，也容易不動產登記配偶名下、家庭庇蔭我婚姻。2.婚姻家庭生活快樂，少婆媳姑嫂問題。3.逢偏財星會權，可投資不動產獲利（夫妻宮-福分財）。也可從事生產行業。4.婚後財富更穩當。一生衣食少憂。5.容易是家人〈或鄰居〉關心〈促成〉的婚姻。",
      "父母": "1.門風和樂。家庭（族）風評好。2.安家定宅，孝養父母。父母愉悅。3.家運好、可能再換房子。也會住漂亮好看的房子〈父母宮─形於外〉。4.宗親往來多含和往來。5.宗門文風盛、書香家庭，或家族中有〈多〉任公職者。與公門關係佳。6.可從事老人休閒、安養事業。7.容易全額置產（無銀貸）。",
      "兄弟": "1.家庭環境好〈或家世好〉、家庭和睦、生活優渥。2.財庫盈溢，支出方便，但防理財不嚴謹而家庭支出花用多。3.家庭（族）生菜，最宜開店營利、經營家族事業。可以店家合一。家庭容易自給自足。4.家庭庇蔭兄弟，兄弟利多、兄弟得福。5.不動產生財，適合經營休閒產業、飯店、旅館、出租業。也利於房地產投資〈偏財星會權尤佳〉。6.家族人氣好（祿照交友）。",
      "交友": "1.家庭經濟支出能力好（庫位祿出）。2.家庭〈族〉人氣旺、人脈好，親朋多往來。3.住家緊臨車站、鬧區、夜市、學校等人潮多的地方。4.可從事咖啡、茶藝、餐飲、飯店、休閒產業。5.鄰里和睦、往來呼應。6.格局好，家業大員工多。格局差，空虛的繁華。",
      "事業": "1.出身家世好。得祖蔭、承祖業。2.家運平順，得家庭福、生活條件優渥。享受現成。3.可投資〈從事〉不動產行業、建築業〈偏財星〉、不動產可生財，可以房屋出租、營利，也可以從事飯店、旅館、休閒等產業。4.容易房子增建、裝潢、整修〈會權尤顯〉。",
      "命宮": "1.家世好、得祖蔭、承祖業、獲家庭福。家庭很容易自給自足。2.有福享受現成、生活條件優渥。少積極、防養尊處優。會權則有拓展力，利於升遷、創業。3.祖地可發跡。格局好，資金足而生意越做越大。適合經營家庭（族）事業。4.天倫樂，家庭和諧、少災。安居樂業。容易出身好、配偶賢良、子孫賢孝。5.6.家宅旺，有子息、少出不孝子。7.不動產緣早。容易有得助置產、遺產、贈予。常年輕有產。8.財產容易增值上漲，地段熱鬧或地價高〈逢偏財星祿、權〉。9.房地產多、不動產可生財，適合出租、自家開店營利。也可以經營旅店、飯店、咖啡、餐飲、休閒事業（容易營造賓至如歸的溫馨感）。10.住所舒適或寬大，住家容易有庭院、空地或面向大馬路〈空曠〉。11.女命旺夫益子。",
      "疾厄": "1.家庭和睦、家運平順。2.生活悠閒，住所寬敞舒適。3.物質生活優渥、衣食豐足。防慣安逸而少積極。4.適合店家合一營利。5.享受生活，非長子格。",
      "財帛": "1.得家庭福、家蔭好、生活條件優渥。享受現成。2.經濟好、金錢進出多。防錢財方便而多花用，少了理財計畫。3.善理財，可以錢滾錢。家庭很容易自給自足，很適合經營家庭事業。4.不動產生財，適合不動產出租、自家開店營利，可經營飯店、旅館、休閒、餐飲業。5.也可以從事〈投資〉不動產行業〈逢偏財星祿、權〉。6.可與父母同住〈財帛為父母的疾厄宮〉。",
      "福德": "1.家庭蔭我、承祖產祖業。2.祖上余蔭、宗親和睦。3.家庭收入好、生活優渥、享受。4.家運好、家安宅吉、宅生和氣。5.住宅舒適寬敞。不動產獲福。6.可從事生產行業（偏財星）。",
      "遷移": "1.家世好、家大業大。家運好、發財富、可從事生產行業〈偏財星會權尤佳〉格局佳，可以光宗耀祖。2.住所門面好、房子大、有庭有院。3.家族興旺、宗門社會關係好。4.會搬家、房子越搬越好。容易住新〈好〉的房子。容易全額置產（無銀貸）。5.6.門外空曠或馬路大，環境怡人。也可能地段值錢（偏財星）。7.鄰里和睦、親朋熱絡。8.容易宗門有仕紳聞人或門第名聲好。注"
    },
    "權": {
      "子女": "1.財富成就子女。2.家庭〈族〉重視教養、成就〈幫助〉小孩。3.祖業成就後輩。",
      "夫妻": "1.家庭成就〈支配〉我婚姻。2.置產結婚，也容易再換更大〈好〉的房子。3.婚後可以更多〈穩當〉的財富成就。4.逢偏財星，可投資房產獲利。也可從事生產行業（權照事業，會祿尤佳）。",
      "父母": "1.住宅外觀氣派、值錢。2.宗門中多善讀書者或家族中有〈多〉任公職者。與公門關係門路好。3.家族中有德高望重的長者。4.格局差，還防家族氣勢過炎。5.全額置產。",
      "兄弟": "1.家庭環境好〈家世好〉。物質生活高檔。家庭活力、積極。2.宜自家開店營利。家庭（族）生財。3.經濟雄厚，家庭成就兄弟，也助我經濟。4.不動產生財、也可以投資房地產事業〈偏財星〉。也宜不動產出租。5.",
      "交友": "1.往往朋友多財勢佳者。2.人際可以成就我財富、利於合夥。3.容易與富者仳臨。4.可從事不動產行業、高貴物品行業〈偏財星〉。",
      "事業": "1.家福祖蔭、家世好、承祖業。2.家運興旺，重物質生活。3.可自家開店、不動產出租、營利。也可以從事不動產行業〈偏財星〉。4.容易房子增建、裝潢、整修〈會祿尤顯〉。5.也可以家族（庭）事業。",
      "命宮": "1.家教嚴或家世好。家庭予我的條件好。2.家庭朝氣、活力、容易家庭成就栽培我，也容易承祖產、祖業。3.住所高大、氣派或鬧區好地段、地價高〈公偏財星祿尤佳〉。4.房地產多、房產值錢或可房產生財〈出租、或開店自家營利〉。5.較重物質生活。6.格局好，資金足而生意越做越大。利於升遷、創業。會祿尤佳。",
      "疾厄": "1.生活環境積極、有勁，家庭朝氣、活力。容易開創。2.物質生活高檔。3.適合自家開店營利。",
      "財帛": "1.家世好、經濟強，家庭活力、朝氣。可以經營家庭事業、創造財富。2.如果善理財，可以錢滾錢。3.容易大筆錢出入。4.可自家開店營利、不動產出租、經營飯店旅館。也可以不動產投資理財〈逢偏財星祿、權，橫發〉。5.重物質生活。防奢華浪費（敢花用）。",
      "福德": "1.家運強、經濟好、收入高。或祖上餘蔭。2.家庭朝氣、活力、希望。3.物質生活高檔、體面奢華。防大筆開銷、過於浪費。朱門酒肉臭。4.可從事生產行業（偏財星）。",
      "遷移": "1.家世好、家大業大。宗門鼎盛。2.豪宅、大面積、大門面〈偏財星祿權交會〉。3.家庭活力、朝氣，蒸蒸日上。家運旺、發富、可從事生產行業〈偏財星會祿尤佳〉。格局佳，可以光宗耀祖。4.宗門多公職人員或宗門社會地位高。5.門外鬧區、市集或馬路大。6.宗門成就高、政商關係。還防財大氣粗，朱門酒肉臭。"
    }
  },
  "交友": {
    "忌": {
      "子女": "1.2.格局佳，多交用心、疼子的朋友。3防交友性好漁色〈桃花星〉。4.交友不長久或知己少相聚，知交朋友不多（沖田宅）。或朋友理財欠佳、不守成。5.配偶與子女不親〈配偶疾厄忌入子女〉，或配偶性欲過多、性功能障礙、雨水不歡（桃花星）。6.有容易遇待人不誠懇的朋友。",
      "夫妻": "1.配偶身體瘦弱。防婚姻生活日漸乏味。2.",
      "父母": "1.格局佳，交喜歡讀書、孝順、說實話的朋友。2.格局差，防交友有偏激、無禮、修養差，出口成髒、不學無術者。3.朋友不多，知己反而不常相聚或好友生離死別（沖疾厄）朋友理財欠佳。4.防小人七嘴八舌。5.配偶耐性差或喜怒形色。",
      "兄弟": "1.交友素質差，防損友糾纏多耗。2.交遊未設防，防小人洞悉我財務狀況，恐遭覬覦。3.朋友有經濟吃緊或多算計者，小心財務遭盜劫、被設計。4.檢點財務，防引狼入室、小人在身邊。外鬼通內神。5.婚姻生活刻板，畫眉少樂。",
      "田宅": "1.2.檢點門戶、防賊盜登堂、宵小入室、歹徒覬覦。防外鬼通內神。3.小心惡鄰，是非串門。4.少與人金錢借貸往來，防被倒錢。5.宜休閒產業、咖啡、茶藝〈消磨時間〉，食品、雜貨、零售業、消耗品、日用品等現金生意〈生活必需品〉。6.〈注",
      "事業": "1.容易交上事業心重的朋友，或朋友中有工作忙碌者。2.格局差，防犯小人作梗，也不利於同行競爭、殺價。3.不利於考試、升遷、競爭。4.幫父母〈上司〉分攤工作。5.",
      "命宮": "1.謹防交友無義、初始甜如蜜的小人糾纏。需要慎選朋友，否則惜情傷己。小心被算計。2.容易交上固執、是非或倒楣、困境、苦惱的朋友。小心惹禍上身。3.朋友不好溝通，久之容易疑心生暗鬼，橫生是非。因熟生仇。4.不利於選舉、考試、升遷等競爭。利於專業涵養及專技工作，則人求之於我。5.不利於同行競爭。也不適合合夥。6.配偶勤快、不得閒。運限差，配偶久病宿疾。7.少與人金錢往來，容易吃虧、遭設計。",
      "疾厄": "1.配偶是跟屁蟲。或配偶閒不住。2.怕寂寞，沒有選擇性的濫交朋友、糾結纏膩。防小人濫情、狐群狗黨、3.4.配偶勤快有餘，還防夫妻相處沒情趣。〈注",
      "財帛": "1.容易交上算計錢財、不仁不義或窮困聊到的對象。忌入財帛常臨急不已。2.容易犯小人，防遭人算計，被蠶食鯨吞或斷我財路。也容易被倒賬。3.多檢點財務，免遭小人覬覦、破財。4.交窮朋友，小心急狗跳進了你家的牆。5.不利於同行競爭、殺價。合夥也可能營私舞弊。",
      "福德": "1.多交重享受的朋友。但防交友多耗、傷財。2.小人之交甜如蜜〈但防友情不久長，反臉將成仇〉。3.或個性偏執孤僻，只能交嗜好相同、氣味相投的朋友。4.知己不得志，得意非知己。5.知心能幾人？終究是孤獨！6.",
      "遷移": "1.不善逢迎、不喜熱鬧，朋友間少交遊。2.知己在遠方。3.多交直來直往、正人君子的朋友。4.配偶個性躁急。5.不利於競爭、考試、、升遷。6.朋友少或朋友間人事凋零。交友不得力。或有孤獨癖性、自以為是而知己者稀。"
    },
    "科": {
      "子女": "1.子女容易遇到良師益友。",
      "夫妻": "1.感情慢工細活、羅曼蒂克。2.心有靈犀的婚姻生活。3.",
      "父母": "1.朋友素質好。多雅儒交遊、謙和君子之交。",
      "兄弟": "2.涓涓滴流，不無小補。",
      "田宅": "1.往來多仕紳、書香入宅第。",
      "事業": "1.多利用媒體、訊息。多讀取相關知識。",
      "命宮": "1.友情綿長。2.少不良嗜好、多謙和文質的朋友。",
      "疾厄": "1.若即若離、含情脈脈。",
      "財帛": "1.交友救急〈未必救窮〉。2.借錢予人，對方容易分期的小額歸還。",
      "福德": "1.交友多知性，往來盡風雅。謙謙君子交。2.配偶身影優雅。",
      "遷移": "1.往來皆文士，逢迎盡風雅。2.配偶舉止優雅〈交友─夫妻的疾厄〉。"
    },
    "祿": {
      "子女": "1.多結識仁慈善良、喜歡小孩的朋友。2.小孩遇上好師長。或子女多交益友。3.或我容易有小輩的忘年之交。4.配偶親近小孩（交友-配偶的疾厄）。5.配偶性能力好〈桃花星〉。",
      "夫妻": "1.配偶容易過胖。2.朋友婚姻多美滿或友人多情。3.人際緣親近我配偶。4.朋友有事業順遂者（祿照事業）。",
      "父母": "1.容易交禮貌、溫和、幽默、見多識廣，漢陽好、親近尊長的朋友。2.人際多和氣愉悅，交友頗得長輩緣。3.交友有善讀書、學識好者。4.或有忘年之交。但防喜歡人家奉承。4.配偶好脾氣（交友-夫妻的疾厄）。",
      "兄弟": "1.不寂寞，人際緣親近我。身邊不乏朋友〈非必熟稔者〉（人氣旺）。2.近悅遠來，適合從事旅遊、旅館、民宿、休閒等行業。3.可以八方來財、財源廣進，適合口碑生意，也適合咖啡、茶藝、餐飲、休閒事業。4.配偶體質好。閨房多趣。5.朋友多經濟好者。",
      "田宅": "1.人氣旺家庭、好客、四方來財。2.親朋、鄰里多熱絡。近悅遠來。3.交往朋友多富者或容易與富者仳臨而居。4.利於朋友合夥、共同經營。5.可從事餐飲、飯店、旅館、咖啡、茶藝、休閒產業。裝潢、室內設計。",
      "事業": "1.人氣旺。人緣好，惠我諸多方便或蔭我事業。容易遇好老闆、好上司。2.朋友多事業如意者，或交往多做生意的朋友。3.得父母事業之蔭（交友-父母的事業）。4.利於競爭、考試。5.利於合夥。利於廣告、宣傳與口碑生意。",
      "命宮": "1.人際獲福、多得益友。2.容易結善緣的朋友。朋友多志趣相投或親近愉悅、通情達理。3.交有錢或圓融的朋友。利於合夥。4.適合公關、業務工作。四方有才。5.職場人緣和諧、常受人助。合夥少失。6.7.利於選舉、競爭、考試。8.配偶好相處，也容易發胖。",
      "疾厄": "1.容易親近、交友多好相處。多得人緣、令人愉快。2.容易交往個性溫和、好情緒的朋友。3.異性間防耳鬢廝磨而擦槍走火。4.可從事服飾、精品及咖啡、茶藝、餐飲、休閒、娛樂等服務業。5.配偶健康，脾氣好。",
      "財帛": "1.與人多金錢往來。2.人緣好、客源佳。很適合做現金生意。四方來財。3.多交手頭方便、少計較的朋友。也容易多交做生意的朋友。利於合夥。4.利於競爭、考試。（注",
      "福德": "1.多交樂天派的朋友。2.人緣好、熱鬧歡愉。多氣味相投、少用心機的朋友。人情味濃。3.喜歡打屁、泡茶、品味〈非必山珍海味〉、出遊。容易我醉君複樂，陶然共忘機。4.身後也哀榮〈福德亦屬身後位〉。5.與配偶相處投緣。",
      "遷移": "1.熱鬧、歡愉、社交圈廣。活耀。2.多與有錢、榮顯、親和、外緣好的朋友為伍。3.社會關係好、人脈佳。交友得力。4.慎防遇奉承巴結、虛偽言好之人。5.喜歡聽奉承討好話。6.7.配偶個性好相處〈交友─夫妻的疾厄〉。"
    },
    "權": {
      "子女": "1.格局差，防小孩結黨變壞。2.格局佳，小孩容易遇上嚴格的師長。3.配偶對小孩管教粗魯〈配偶疾厄權入子女〉。4.配偶性能力強〈桃花星〉。",
      "夫妻": "1.配偶健康、活力、好運動。2.交友多有成就〈權照事業〉、婚姻體面者。",
      "父母": "1.格局佳，交友有善讀書、見多識廣者。2.格局差，防朋友中有傲慢、偏見、得理不饒人、修養不足者。3.",
      "兄弟": "1.身邊多有成就的朋友。2.格局佳，朋友成就我賺錢。3.四方旺財，可從事精品、貴重、高價位商品買賣。4.配偶體質強。加忌，房事過度（桃花星）。",
      "田宅": "1.往往朋友多財勢佳者。2.人際可以成就我財富、利於合夥。3.容易與富者仳臨。4.可從事不動產行業、高貴物品行業〈偏財星〉。",
      "事業": "1.朋友多事業有成就者。2.得人助我事業。容易遇上強勢老闆或上司。3.4.競爭壓力、棋逢對手。但利於讀書、考試。5.利於合夥。",
      "命宮": "1.格局好，多交有能力、有成就的朋友。也容易遇到能力好的上司、老闆。2.人際層面高，朋友成就我。3.格局差，被人牽著鼻子走。4.考試、競爭、競選、升遷容易棋逢強手。5.同行競爭壓力（會忌尤顯）。6.配偶身體健壯。7.利於合夥。",
      "疾厄": "1.對方主動、大方。2.容易交往主動、好動的朋友。",
      "財帛": "1.多交會賺錢的朋友、敢花錢或做生意、手頭綽的朋友。2.格局好，交友成就我。利於合夥。3.格局差，小心同行競爭壓力。4.宜高價位、高格調的生意。（注",
      "福德": "1.多交豪氣、海派、愛現、不服輸的朋友。2.格局差，眼高手低、自不量力。3.但防趨炎附勢，庸俗的上流美、朱門酒肉臭。4.適合高品位、高價位元的產品銷售。5.配偶身體健康、活力。",
      "遷移": "1.多交有身分地位、有成就的朋友。2.容易往來政商名流。交友得力。3.慎防遇吹噓、唬爛之人。4.眼睛看高不看低。5.配偶健康，個性直線條，大方、乾脆。"
    }
  },
  "事業": {
    "忌": {
      "子女": "1.工作全家忙。適合生活消耗品的先進小生意。2.合夥須費心（不佳），小心碰上窮對象。3.格局差，防事業不順、工作不穩，人生多起伏。難守成。事倍功半。4.宜安定於公職或大企業上班安定。5.宜店、家分開。",
      "夫妻": "（事業忌出）1.2.適合現金銷售業，不宜投資回收慢的生產行業〈忌出〉。3.適合上班安定。也適合技術、顧問、仲介、買賣、代書等服務業〈無須囤貨、不壓本金〉〈忌出者，不得冒風險〉。4.創業需夫妻胼手砥足。5.",
      "父母": "1.不善阿諛奉承，有苦勞、少功勞。2.宜公職或大企業上班安定。3.格局差，防工作、收入不安定、情緒起落，人生多起伏、變動。難守成。4.不宜合夥，小心碰上窮光蛋。5.容易打工、做做停停、遊牧式的工作環境。",
      "兄弟": "1.個性安定、守成。辛苦累積。容易公職或大企業上班安定到退休。2.容易事必躬親、老闆兼夥計。3.個性較內斂，對朋友不多情，少社交〈沖交友〉。4.也適合現金生意〈忌，點滴累積〉。5.",
      "田宅": "1.個性守成、安定、盡責。常公職、大企業上班安定到退休。2.與家人胼手砥足的現金生意〈忌，點滴累積〉。可以家、店合一。適合生活必需品的銷售。3.個性較內斂，對朋友不多情，少社交〈沖交友三方〉。4.",
      "交友": "1.格局不旺，少當老闆。最宜上班族或小生意格。只適合生活消耗品銷售。2.但防重義輕利或經營不得要領、事倍功半，也防人生多起伏、異動、難守成。3.防被損友拖垮、也不宜合夥防被倒賬款。（注",
      "命宮": "1.勞累〈含壓力大、忙碌或工作時間長〉。欠事業債、勞碌到老。2.格局差則煩心、不順，格局好也多累人。3.容易職業倦怠、多苦勞而少功勞。4.女命易為職業婦女。5.適合上班安定或小生意。〈注",
      "疾厄": "1.工作勞累〈時間長或工作量多、粗重〉、忙碌、緊張。2.容易職業倦怠、過勞。3.欠事業債、容易工作到老、少有替手。4.個性較內斂對朋友不多情，少社交〈沖交友三方〉。5.容易是製造業、加工業、技術界或現金小生意〈點滴、辛苦累積〉的工作。6.事多躬親，老闆兼夥計。7.",
      "財帛": "1.只適合利潤薄的小生意。格局好也多劬勞之得。2.3.最宜上班固定薪水。4.不宜賭、投機（沖福德）。（注",
      "福德": "1.最宜從事興趣的工作，可以執一專精。工作不合意則多職業倦怠。2.容易運氣不佳，防事業競爭、薄利、虧損、不如意。凡風險大、回收慢，壓本、囤貨等事業皆所不宜〈沖財帛〉。3.宜小本生意、仲介、技術、顧問、會計、代書等服務業（沖財帛）。4.5.最宜上班安穩。",
      "遷移": "1.拙樸憨直、不善手腕、攀緣，、不討好〈事業忌出〉。敏銳度不足。容易預設立場。2.際遇非佳，天不從人願，少從商、勿投機。勿賭。不善汲營。3.不適合創業，防接單不順、工作停擺。4.宜仲介、顧問、技術、會計、代書等服務業〈不需囤貨、壓本〉。或薄利買賣營生。5.最宜公職、大企業上班安穩。"
    },
    "科": {
      "子女": "1.培養小孩書香氣息。2.文教工作。",
      "夫妻": "1.應精緻于包裝、文宣、廣告。",
      "父母": "1.宜企劃工作。2.精緻產品包裝。廣告、文宣。3.文教事業。",
      "兄弟": "1.細水長流的事業、平穩有餘。2.上班安定。",
      "田宅": "1.上班安定或小生意。平穩是福。2.適合裝潢、室內設計。",
      "交友": "1.多作文宣、廣告。加強精緻包裝。",
      "命宮": "1.平穩。2.多得貴人助。",
      "疾厄": "1.工作平順。2.容易文職、少流汗的工作。",
      "財帛": "1.利潤不大、平順就是福。2.宜企劃、理財、作帳。3.宜上班族安穩。",
      "福德": "1.適合精緻、美學、精神、宗教、藝文事業。",
      "遷移": "1.應精緻于包裝與文宣。"
    },
    "祿": {
      "子女": "1.有合夥機會，蔭合夥〈未必賺錢〉。2.小孩可以承傳我的工作，或事業庇蔭小孩。3.可以從事幼教、托嬰、兒童用品事業。4.宜離家向外求財。或加強業務工作。",
      "夫妻": "1.事業順暢、賺錢〈祿出〉。適合過手的買賣業。也適合廣泛產品的推陳出新。創新、領先。2.婚後事業較穩當。工作蔭配偶。3.適合以異性物件為客戶。工作上的異性緣旺、好。4.信譽好、也宜貿易、買賣業〈事業祿出〉，比較不宜單一產品的生產行業。5.適合公關、銷售、廣告業務（祿出-升揚於外）。也適合婚友社。6.特種營業〈偏財星〉。7.房屋銷售、仲介〈偏財星〉家電、傢俱〈夫妻為田宅的共宗六位〉。8.9.也適合精品、藝品、古董及貴重物品銷售。",
      "父母": "1.工作讓長輩〈上司〉滿意，容易受賞識。2.事業上口碑好、信譽佳，適合廣告、文宣、業務、學有專精等工作。3.適合老人看護、文教、廣告事業。4.喜歡說好話、做好事。好幕僚格。5.利於在職進修、邊做邊學。",
      "兄弟": "1.事業多順心、穩當，但非汲營勞累之得。多綿長如意。2.利於升遷、也可創業。3.待遇好、高收入。宜業績分紅薪水。4.事業蔭兄弟、少計較。可與兄弟合夥。",
      "田宅": "1.蔭家庭、少計較。2.工作順遂穩當、如意綿長（福入收藏宮）。3.宜從商，適合建築〈偏財星〉、五金、裝潢、水電、家電、傢俱、日用品等的家庭用品行業。4.格局佳，也可從事生產行業。5.可高薪、高職，或業績分紅薪水。",
      "交友": "1.人緣好、惠人方便、庇蔭於人。職場愉快。上班族很能替老闆賺錢。好幕僚。2.需要人氣的事業經營，宜鬧市、賣場的人潮生意或口碑取勝的服務業。3.適合大賣、直銷、超商，售後服務。4.利於升遷，未必利於創業。",
      "命宮": "1.運氣好、樂觀有福。2.工作容易入手，也容易工作順心〈含收入、升遷與拓展的前瞻性〉、職場如意、逢對時機、入對行業。3.可以做自由業或做生意，以及自己興趣的工作，上班也容易如意順遂。最怕滿足而失去持續鬥志。4.宜業績分紅薪水〈祿為福-運氣好，可以多收入〉。也容易付出多而收入增。5.與子女相處愉快〈事業─子女的疾厄宮〉。6.祿喜權會，則機遇會更好、拓展的空間會更大。會科則穩當綿長，會忌則辛苦多得。",
      "疾厄": "1.工作輕鬆、職場順心、事業如意。工作機會也容易入手。2.非汲營勞累、不很敬業，卻容易心想事成、吉人天相。3.格局好，可以收入高、越做越順手。4.宜業績分紅薪水。也可以做生意。5.可以從事休閒、養生、娛樂、美容、服務等行業。",
      "財帛": "1.生意好、投資回收快、利潤好或銷路大。2.容易高薪、高職、高收入。3.宜變現快的現金生意，或業績分紅薪水。4.祿喜權會，則機遇會更好、拓展的空間更大。會科則財源綿長，會忌則辛苦多得。",
      "福德": "1.樂觀知足。也運氣好、事多如願。容易事半功倍。2.事業如意、順暢。也容易找到合興趣或輕鬆的工作。勤快的話，收入很能如願。3.適合娛樂、旅遊、咖啡、茶藝、餐飲、休閒、心靈、才華、藝品、流行時尚事業。",
      "遷移": "1.外緣好、廣得人和，機會多、際遇好、工作容易入手（祿出-升揚於外）。2.工作向外發展好、運氣順暢。3.善用廣告、文宣可成長業績。4.可以建立好的口碑、信譽、廣受歡迎。5.適合業務、公關工作，也適合運輸業，旅遊〈太陰祿〉、休閒產業、貿易〈太陽祿〉往來。寬廣大器量。可以領先潮流。6.配偶圓融、外緣好（事業-夫妻的遷移）。7.也適合精品、藝品、古董及貴重物品銷售。"
    },
    "權": {
      "子女": "1.成就〈栽培〉子女。2.工作上助益合夥。或多掌權合夥。3.專業的的小孩教養工作。",
      "夫妻": "1.配偶婚後亦將更有發展（事業-配偶的遷移，化權返照原命事業）。2.我事業順暢、賺錢〈權照事業〉。適合過手的仲介、買賣業（權出）。3.品質好、信譽佳（權出），事業可拓展銷售版圖。宜推陳出新的企劃與銷售，領先潮流。4.適合先立業後成家。5.也適合精品、藝品、古董及貴重物品銷售。",
      "父母": "1.利於專業性、專利性、專技性工作。2.積極、活耀，利於專業講師、學有專精等具說服力工作。3.利於廣告、促銷。4.在職進修、邊做邊學。",
      "兄弟": "1.個性積極、開創。事業穩固、拓展。2.周轉順暢、越做越大。3.宜專技、專業，更具發展空間。4.事業成就兄弟。5.利於升遷、創業。",
      "田宅": "1.具積極、衝勁。事業多穩固、拓展（權入收藏宮）。2.利於升遷、創業。擁專技、專業尤佳。格局佳，可以從事生產行業。3.適合房地產、建築業〈偏財星〉、五金、裝潢、水電、家電、傢俱、家庭用品。4.高薪、高職或業績分紅薪水。",
      "交友": "1.活耀、愛現，成就別人。工作上成就老闆〈上司〉、助益同事。好的幕僚格。2.適合促銷、大賣、批發，口碑與信譽的生意。3.是父母工作上的得力助手。4.格局差，防好高騖遠，重看不重用。5.利於升遷，未必利於創業。",
      "命宮": "1.運氣強，容易開創有成，可以發揮創造。常職場得意，事業越做越大。2.具前瞻的見識與自信，積極與開創。適合領導、開發。3.容易受拔擢，利於升遷、創業。擁專技、專業尤佳。4.權喜祿會，則更具天時地利人和，會科則兼俱果敢與細膩，會忌則工作吃重、非常累人。",
      "疾厄": "1.活力、幹勁。工作常負重。2.事業容易拓展，但耗體力、活動量大。3.個性主動、乾脆。具耐力與抗壓性。4最宜技術性粗活。5.格局好，收入高。敢賺敢花。",
      "財帛": "1.主見、積極，有拓展空間。可以高單價、高利潤、高收入。2.最好專業、專技，開發、領導的工作。3.可以高薪、高職位，或業績分紅薪水。4.也容易創業、升遷。5.權喜祿會，則機遇會更好、拓展的空間更大。〈注",
      "福德": "1.積極、幹勁，具企圖與信念。2.容易大手筆的作為。3.會賺錢，越做越大。容易大筆收入。4.宜專業、特殊技能。5.也適合精品、藝品、古董及貴重物品銷售。",
      "遷移": "1.能力好、積極、活力。2.最適合擁有專業、專技、專利，利於開創、領導。領先流行。3.容易營造氣勢、可以建立品牌、口碑。4.利於升遷、創業。5.配偶能力強、社會地位好（事業-夫妻的遷移宮）。6.也適合精品、藝品、古董及貴重物品銷售。"
    }
  },
  "命宮": {
    "忌": {
      "子女": "1.疼子、用心於小孩、愛深責切。2.格局差，為子操勞、欠子債、代溝。3.驛馬、搬家、脫產、退財。空勞忙。收入不穩定。4.5.或合夥人運勢蹇滯。合夥人非大格局。6.自己也在家呆不住。7.小心與人金錢往來（沖庫退財）。8.（注單忌的桃花化象未必惹禍，需雙忌以上的破格乃生禍端。）",
      "夫妻": "1.對感情執著、疼惜配偶、負責。2.命格差，婚姻〈感情〉乖違，諸多付出、苦恨。也或有情到深處無怨尤。3.命格差，有迷情怠志、沉迷感情、甚或拋夫〈妻〉棄子，產生愛恨情仇。4.勿賭、投機，別妄想不勞而獲〈福分財不旺、忌沖事業〉。5.適合上班或不囤貨不壓本，日常用品、消耗品的買賣生意，宜仲介、技術、會計、顧問、代書等服務業〈事業忌出〉。6.不宜單一產品（事業忌出，不能長久安穩）。",
      "父母": "（疾厄忌出）1.容易得罪人。城府淺、少耐心。2.格局好，孝順父母。也愛唸書。3.也是對人的惜情重義象。處世不得要領，事倍功半。4.格局差，心直口快〈可能心無毒〉、招惹是非〈加命、疾厄或福德權，性烈〉。6.也防合夥帳目不清。7.宜多讀聖賢書，則兼具內涵與率直。7.很容易有銀行貸款的負擔。",
      "兄弟": "1.個性守成、勤快、儉約、盡責、儲蓄，白手可起家、老闆兼夥計。容易事必躬親。做生意常從小兒大。2.容易是長子、拉拔兄弟。3.交友不多情〈適可而止〉，內斂、少社交〈沖交友〉。4.可以上班安穩、容易兼職、加班。也可以做生意，大小錢都賺，一步一腳印。5.現金生意〈忌，點滴累積〉。6.命格佳，勤儉致富、積沙成塔。7.女命常為職業婦女。8.",
      "田宅": "1.個性守成、顧家、勤快、儉約、惜福、儲蓄〈與窮富未必有直接關聯〉。容易事必躬親。具家庭責任心。2.多為長子〈或非長子而有長子個性〉。3.格局好，可以白手起家、老闆兼夥計。善守祖業。4.個性內斂，對外難免私心、不吃虧、不多情、少社交〈沖交友三方〉。5.格局好，勤儉致富、積沙成塔。6.驛馬難動。7.女命顧家，容易為職業婦女。8.做生意，由小到大，步步為營。9.適合現金生意〈忌，點滴累積〉。10.適合生活必需品的銷售（忌入田宅）。11.12.子息緣較弱。或放不下而為兒孫所役。（注",
      "交友": "1.個性惜情、重義、磊落、散財，為人守信重然諾、仗義疏財。2.3.格局差，人生多起伏、難守成，小心與人金錢往來〈沖兄弟庫位，主失、耗，多變動、斷財路、收入不穩定〉。4.格局差，防濫情無智、交友無義。5.不利於競爭、考試、升遷。6.7.配偶勤快、閒不住。8.不利於合夥。防信人太過或人事不濟。9.不利於創業，適合上班安穩。",
      "事業": "1.敬業、專注、勤快。個性容易事必躬親，容易校長兼撞鐘。2.格局差，但防個性專注一方成偏廢的不能顧全大局（許多技藝專精的老師傅之所以無法創業，既存在於此一個性）。3.適合專職、專業及專門技術性的工作。4.當然也適合上班安穩。如果創業最好會權，也必然老闆兼夥計。5.女命多為職業婦女（勤快）。6.格局好，可以勞有所得，辛苦有成。7.爛婚外情〈桃花星〉〈夫妻忌出而失情義，不專情。格局差，還防壞了婚姻〉。8.小時候宜重拜父母，當人養、契、義子〈沖夫妻宮少小限〉（雙忌以上）。9.不宜賭、投機（沖夫妻）。〈注",
      "疾厄": "1.勤儉。2.耐力、堅持。容易事必躬親，校長兼撞鐘。做生意，多從小店面開始。白手可起家。3.多勞多動，不易發胖。會權，更能耐勞抗壓。4.勤快，容易兼差、兼職、加班。5.女命容易是職業婦女。男命也多長子格。6.女命逢太陰星愛漂亮、愛乾淨，忙於減肥、節食、美容。7.逢貪狼星",
      "財帛": "1.大、小錢都賺。2.為財勞碌、容易事多躬親。3.女命易為職業婦女。4.格局佳，小生意也賺大錢，但不免勞碌。格局差則為財煩勞、賺辛苦錢。5.可上班、兼業或現金生意。〈注",
      "福德": "1.執著所好、偏執其欲。容易大成大敗。2.重視享受、捨得花錢〈財帛忌出〉。3.格局佳，能寓興趣於工作、鑽研專注；格局差，玩物喪志、無荒工廢業。4.適合研發、設計工作〈會祿權〉，也適合不囤貨不壓本的仲介、技術、會計、顧問、代書等服務業〈沖財帛〉。5.少投機，遠睹、毒、酒色等不良嗜好，以免迷情妄欲，自毀前程。6.命格差，容易杞人憂天、憂患太過。女命尤顯。也容易沾染不良嗜好。7.格局差，運限低，防病痛折磨、有事憂惱〈雙忌以上〉。適合宗教的修心（行）。",
      "遷移": "〈命宮忌出〉1.耿直、憨厚、忘性、嚴肅、刻板、內向、少心機、不善察言觀色、後知後覺。不善逢迎攀緣。2.不重形象，不喜歡繁華虛榮。拙樸而容易害臊、緊張，直來直往。3.正直有餘而圓融不足，容易招排擠。宜閒事少理，謹防小人，只能獨善其身〈別妄想兼善天下〉。不善汲營。4.勿投機、賭，別妄想不勞而獲，最好老實處世（福不足）。最宜一技在身謀生活。勿追求高名、利，否則高處不勝寒。5.不發少年人（拙朴憨直需多磨練）。6.爛驛馬〈少寄望衣錦還鄉〉。7.可以為正人君子 ，還需留意人情世故、增廣見聞。容易自我預設立場。8.女命安靜守分〈無才便是德〉〈多為傳統婦女個性〉。9.修行"
    },
    "科": {
      "子女": "1.對子女講道理，文明、書香。2.與子女不即不離、民主式教養。",
      "夫妻": "1.配偶漂亮或有氣質。2.情緣悠悠、緣斷情未了。加祿",
      "父母": "1.文質、秀氣。談吐斯文、平和。父亦儒雅。",
      "兄弟": "1.理財量入為出。經濟平穩。2.與兄弟有商量。",
      "田宅": "1.喜歡樸實、幽靜、書香的環境。2.房子大小適中。",
      "交友": "1.君子淡交、友情悠遠。2.朋友久失聯仍搭上線。3.",
      "事業": "1.平穩有餘、但防魄力不足。2.宜上班安穩。適合文職或企劃工作。3.",
      "疾厄": "1.不胖不瘦、身影優雅。病得良醫。2.個性不疾不徐。少戾氣。防優柔。",
      "財帛": "1.量入為出、平穩溫飽。方便小額周轉。2.對金錢企圖心不大，宜上班族安穩。",
      "福德": "1.恬淡安逸、不好虛華。2.個性平和、不疾不徐。臨急貴人好。",
      "遷移": "1.高雅、秀氣、平和。防矯飾。2."
    },
    "祿": {
      "子女": "1.容易子息緣旺，子女也多有出息、享子福。子女孝敬我。2.子女個性通情達理。子女親近我。3.可做小孩子的生意，適合幼教、托嬰、兒童用品。適合向外求財（子女-田宅之外）。4.親戚多往來（子女-婚姻而來的親戚位）。5.合夥佳，會賺錢。6.晚運吉祥。容易逢凶化吉（子女-福德的共宗六位）。7.驛馬，除外有錢賺。適合跑業務，四方有財。8.性生活較美滿，也防桃花外遇（桃花星）。（注",
      "夫妻": "1.獲婚姻〈異性〉福。配偶賢良。配偶不固執、好溝通。婚姻（感情）協調。2.異性緣好（但防劈腿、外遇）。情〈婚〉緣早發。3.婚後諸事順遂。婚後運氣轉好。4.外遇多能紙包得住火〈有福〉。5.格局差，當小白臉也容易混吃喝。格局好，雙妻命，得妻財、妻助、異性助。6.做業務，多找異性物件為客戶。異性合夥亦佳。異性的上司、下屬、員工多較好。7.一生衣食無憂、金錢不虞匱乏。逢偏財星，中獎、意外財（夫妻-福分財）。9.少小運限平妥〈第二大限前所有年歲〉。",
      "父母": "1.得父母蔭、有長輩緣。父母開明。2.聰明、利於學習，可以見多識廣。也利於唸書、升遷、證照等考試。與公職較有緣。3.少文書困擾〈父母宮為文書宮〉。4.最宜做長輩客戶生意。容易長輩（長官）提攜。遇到好長官、上司。專業涵養可生財。5.或有忘年之交。6.外〈夫〉家家境好。婚後可與父母同住。7.小孩事業順利。",
      "兄弟": "1.兄弟順遂，兄弟通情達理、手足情深、兄弟是我福。2.我亦事業平順、豐衣足食、經濟不虞匱乏。格局好，資金足而生意越做越大。3.家庭生髮，收入好、周轉方便。4.生活條件優渥、享受。但防養尊處優。5.體質好、畫眉樂。6.利於高薪、分紅薪水。也可以創業，會權尤佳。7.母緣佳，與子女相處和樂。",
      "田宅": "1.家世好、得祖蔭、承祖業、獲家庭福。家庭很容易自給自足。2.有福享受現成、生活條件優渥。少積極、防養尊處優。會權則有拓展力，利於升遷、創業。3.祖地可發跡。格局好，資金足而生意越做越大。適合經營家庭（族）事業。4.天倫樂，家庭和諧、少災。安居樂業。容易出身好、配偶賢良、子孫賢孝。5.6.家宅旺，有子息、少出不孝子。7.不動產緣早。容易有得助置產、遺產、贈予。常年輕有產。8.財產容易增值上漲，地段熱鬧或地價高〈逢偏財星祿、權〉。9.房地產多、不動產可生財，適合出租、自家開店營利。也可以經營旅店、飯店、咖啡、餐飲、休閒事業（容易營造賓至如歸的溫馨感）。10.住所舒適或寬大，住家容易有庭院、空地或面向大馬路〈空曠〉。11.女命旺夫益子。",
      "交友": "1.人際獲福、多得益友。2.容易結善緣的朋友。朋友多志趣相投或親近愉悅、通情達理。3.交有錢或圓融的朋友。利於合夥。4.適合公關、業務工作。四方有才。5.職場人緣和諧、常受人助。合夥少失。6.7.利於選舉、競爭、考試。8.配偶好相處，也容易發胖。",
      "事業": "1.運氣好、樂觀有福。2.工作容易入手，也容易工作順心〈含收入、升遷與拓展的前瞻性〉、職場如意、逢對時機、入對行業。3.可以做自由業或做生意，以及自己興趣的工作，上班也容易如意順遂。最怕滿足而失去持續鬥志。4.宜業績分紅薪水〈祿為福-運氣好，可以多收入〉。也容易付出多而收入增。5.與子女相處愉快〈事業─子女的疾厄宮〉。6.祿喜權會，則機遇會更好、拓展的空間會更大。會科則穩當綿長，會忌則辛苦多得。",
      "疾厄": "1.懶散、不想多動、也容易發胖。2.家運好、少操心擔當、生活條件優渥、享受現成。心情常好。懶人懶福。3.工作地方〈店、工廠、辦公室〉舒適。4.緩散有福，少久病糾纏。但防慣於養尊處優。5.容易相處、好商量、好人緣（疾厄-交友的福德宮）。6.媳婦緣好。小孩也異性緣早來。7.格局好，店面越做越大。大店面，生意好。",
      "財帛": "1.樂觀有福、財神爺喜歡你〈非必全由自己賺得〉。來財容易、現金方便〈未必富有〉。但防樂不思蜀、滿足現狀。2.容易高所得或來財容易，不宜固定薪資，宜業績分紅薪水。3.現金緣好，適合業務、銷售等工作及現金生意（現金緣好，直接見利）。4.5.祿喜權會，則機遇會更劄實、拓展的空間更大。會科則財源綿長，會忌則踏實而辛苦多得。〈注",
      "福德": "1.福報好、樂天知命，樂觀少計較。個性也容易凡事往好處想、編織美夢。2.安逸有福、常不求自得、心想事成。衣食豐足。喜歡悠閒。善自我調試。3.容易遇難呈祥或禍不臨身。4.具壽相、晚景優。器量大。興趣廣。5.少久病惡疾之磨。6.適合藝術、才華、心靈、文化等精神工作，也可從事休閒、旅遊、時尚等事業。最好寓興趣於工作。7.逢偏財星，中獎、意外財，不勞而獲。",
      "遷移": "1.活力、能幹、果斷、智慧、膽識、權變、意志力。2.應變佳、善謀略〈權變〉，可以領導統馭、開創拓展。3.利於升遷、創業。4.擁專業、專技尤佳。5.格局不佳，獨斷、霸氣、自負，容易結怨。喜會祿而得相容並蓄。"
    },
    "權": {
      "子女": "1.栽培、管束子女〈加福德、疾厄忌，嚴苛霸道〉。2.成就合夥或容易合夥掌權。3.加忌尤顯。4.不適合守株待兔，宜向外求財。",
      "夫妻": "1.對婚姻〈感情〉占權、支配的欲望〈但防容易起爭執〉。2.理智型的感情世界。3.容易獲成就〈權照事業〉。4.擁專業、專技尤能開創。5.逢偏財星，中獎、意外財。",
      "父母": "1.格局差，個性直沖，得理不饒人、大嗓門、霸氣容易得罪人。2.格局差，傲慢、失禮、偏見、惹是非。3.格局好，善讀書、多學習、高學歷、專技、專業，利於立足社會。4.加福德或疾厄忌，則性情險躁、粗魯，容易動怒壞大局。5.利於公職。利於念書、考試。6.成就小孩的事業。",
      "兄弟": "1.容易昆仲居長或對兄弟占權。2.有見地、抱負、活力，也具企圖、開創、積極。敢策劃、投資。3.具膽識與決斷、領導能力〈權沖交友〉〈防霸氣〉。4.開源、兼職、創業。敢賺敢花，理財有方。5.容易重物質生活。6.體質較好、少病痛之擾。7.喜會祿，得福而更能水到渠成。",
      "田宅": "1.家庭中占權、對子女也管教嚴格。2.多有抱負、朝氣、活力，可以拓展財富。利於升遷、創業。喜會祿，得福而更能水到渠成。3.喜歡高大、氣派的住宅，也容易整修、增建、裝潢、頂樓加蓋。4.住家有庭院或面向大馬路〈空曠〉。5.可自家開店營利、房屋出租。6.較重物質生活。7.女命也儼然成為一家之主。（注",
      "交友": "1.雞婆、熱心、愛現、替人出頭。或喜歡支配、成就他人。利於學術的專業涵養。或公職的服務人群。2.善於人事運作，可以成就別人。利於幕僚工作（能成就上司、老闆）。3.格局差，防自以為是，不納忠言、曲高和寡；或防金玉其外、虛有其表。4.利於競爭、考試。",
      "事業": "1.有見識、積極、開創、自信、活力。謀略、應變能力。〈注",
      "疾厄": "1.好動、積極、耐力、運動。2.抗壓性高、蠻皮、拖病延醫。3.個性不矯飾、粗線條。4.體型結實、健康，小病少。防運動傷害，瘀、內傷〈權、忌同宮尤顯〉。5.適合運動量大的工作，也重物質生活。6.喜會祿，動靜兼得，有志竟成。適合開店營利。7.家運強。",
      "財帛": "1.具有企圖、積極、開創與多謀、應變能力。2.敢賺敢花、活動力強。常利潤高或大筆的收入（權）。3.容易升遷、創業，也容易兼職、副業（不滿足）。4.適合市場的開發、領導與銷售。宜專業、專職。5.權喜祿會，則機遇會更好、拓展的空間更大。6.能高薪、高職，宜業績分紅薪水。（注",
      "福德": "1.不服輸、好大喜功、敢賺敢花。2.講排場、愛體面〈格局不佳反成好高騖遠、眼高手低〉。會祿成虛榮心。3.擁專業、專技常大筆收入。4.做生意走高品質〈格調〉、高價位、大手筆的作法。5.重物質生活，愛用高級貨〈彰顯財力〉。防奢華浪費。〈注",
      "遷移": "1.活力、能幹、果斷、智慧、膽識、權變、意志力。2.應變佳、善謀略〈權變〉，可以領導統馭、開創拓展。3.利於升遷、創業。4.擁專業、專技尤佳。5.格局不佳，獨斷、霸氣、自負，容易結怨。喜會祿而得相容並蓄。"
    }
  },
  "疾厄": {
    "忌": {
      "子女": "（退敗象）1.身教不佳。或不耐煩，不喜歡小孩纏我。小孩也會不喜歡我。2.不耐靜、沒耐性，愛無聊溜搭。3.個性不穩定、城府淺，防人生多起伏、好事也會從身邊溜走。坐立難安。4.房事頻繁或公式化、少了情趣。或傷了身。5.",
      "夫妻": "1.體質瘦或弱，不容易胖。2.3.4.凡事也容易好景不常。",
      "父母": "（忌出、退敗象）1.脾氣快直、喜怒形色、修養欠佳、城府淺而少深思、沉不住氣〈加權則衝動易怒、叛逆晦辱〉。2.然少耐性、不耐靜。人生大不討好、起伏多失、不易守成。不受歡迎。3.格局差，發病則藥石罔效或很快死亡，容易缺陷傷殘〈破相或器官摘除〉〈疾厄忌出〉。",
      "兄弟": "1.格局差，體質欠佳、情緒不開朗。2.少逢迎往來的社交〈沖交友〉。3.4.安定就是福，最宜守成勤儉、溫飽有餘。5.（注",
      "田宅": "1.2.個性容易足不出戶，少社交。3.家運窒滯。宜改變宅內外行走動線。（最宜開啟命盤祿權動陽方）。4.亟需運動、親近大自然（陽長陰自消）。5.格局佳，也庸碌到老，六親少助。",
      "交友": "1.與人相處較冷漠，也不善肢體語言。不懂得體貼。友情無法熱絡。2.小心健康下滑。3.4.小心壞的習性，令人不悅。 5.格局差，還防工作不穩當，收入不平均（沖兄弟-事業的共宗六位）。",
      "事業": "1.工作場小、劣，環境差。宜小店經營。2.職災、過勞。工作常不稱心、不堪負荷。3.宜上班安定，或從事不囤貨壓本的技術、仲介、顧問會計、代書等服務業。切不宜生產事業。4.體型瘦弱，不容易胖。5.還防時不予我。不宜回收慢的事業。〈注",
      "命宮": "1.忙碌、壓力、身不由己、勞碌命。常工作量多、累重、過勞。2.個性即說即做，不喜拖拖拉拉。3.命格好，個性較內斂沉穩。命格差，容易情緒化的惱火、煩心，不能放下（松）。不能隨遇而安。4.5.家運較蹇滯。容易生於憂患勞忙而病于安樂（業力之纏）。6.不易發胖、胖者反為病。7.女命多為職業婦女。男命也有長子格。8.做生意，店面不宜貪大，店大反不聚財。9.小心投資，不可以做回收慢的事業。10.應退而不休（勞碌命）或規劃養生、運動、義工等事來做。否則容易年輕操勞而老來操病。最容易有久病宿疾纏身。",
      "財帛": "1.過勞的賺錢或具危險性、職業傷害的賺錢方式（沖福德）。辛苦勞累之得。2.亂無章法的花錢或狗急跳牆的撈錢、辛苦的賺錢。3.病痛、不良嗜好的花錢、或長時間的醫藥費。脾氣暴烈（福德忌出）。4.適合從事不囤貨壓本的技術、仲介、顧問、會計、代書等服務業。5.家運弱，家庭中的病痛、暗耗、乖違等等的花錢。6.容易遇上計較、貪小便宜的物件（疾厄-交友的福德）。7.8.宜小店經營。不可以投資回收慢的事業。也不宜從事生產行業。",
      "福德": "1.生活環境的緊張、壓力。或生於憂患，病于安樂。2.運限差，久病、沉屙。身心憔悴（業力糾纏）。或有難改的惡習、天性，自限其孽。3.容易情緒不開朗、精神不暢快，妨礙工作與賺錢。也容易家運不振、好景不常。4.病痛花錢（沖財帛）。5.格局差，荒功廢業、傷財、傷身。也容易染不良嗜好而難以戒除。6.亟需運動養生、親近善知識，調適身、心、靈。",
      "遷移": "1.個性躁急、沒耐性、沉不住氣、叛逆、壞脾氣、人緣不好。容易壞了大事。坐立難安。2.3.工作環境差或遊牧式的工作地點。4.瘦、不容易發胖，防胖則病。5.格局差，容易傷殘、血光，或很快的死亡〈疾厄忌出〉〈缺陷、破相或器官摘除〉。6.不宜從事生產行業，防好景不常在。"
    },
    "科": {
      "子女": "1.身教好。2.與小孩若即若離，對小孩和悅輕聲。",
      "夫妻": "1.身材適中、好看。2.行止優雅。",
      "父母": "1.文雅有禮。舉止平和。",
      "兄弟": "1.養生、保健。",
      "田宅": "1.生活恬淡、淡中有味。",
      "交友": "1.與人相處斯文、優柔、含蓄。",
      "事業": "1.體型文弱〈非必多病〉或動作溫文。2.工作場不大、適中。開店宜注意擺設及氣氛。",
      "命宮": "1.身材適中、身影文弱。2.個性較溫文和平。",
      "財帛": "1.身影優柔、文弱。2.祥和、有病得貴人。",
      "福德": "1.健檢、養生、惜身、惜福。2.家運平和。",
      "遷移": "1.有病容易得好藥、良醫。2.舉止優雅、慢條斯理。但防優柔、多豫。3.保養得宜，身材可以婀娜多姿。"
    },
    "祿": {
      "子女": "1.親近小孩。對小孩和悅、耐性，很能討小孩喜歡。2.3.喜歡外面溜搭。",
      "夫妻": "1.最容易過胖，減肥不易。終致越來越懶得動。2.溫柔體貼、肢體傳情。3.家運好〈祿照事業〉。4.做生意宜門面顯眼。不宜小店經營。5.可從事生產行業（偏財星會權尤佳）。",
      "父母": "1.脾氣好、心情常愉快、臉上多笑容。和藹。2.溫和、好言、幽默、好相處。3.親近、體貼長者。4.格局差，防阿諛讒媚，好言奉承。",
      "兄弟": "1.親近兄弟。2.健康平順、享受生活。3.親近子女〈兄弟-子女的福德宮〉。4.工作場宜寬敞，賺錢更順。可以營商。",
      "田宅": "1.家運好、家安宅和（疾厄-田宅的事業宮，家運位）。2.在家時間多、與家人愉快好相處。3.喜歡寬敞、明亮的空間、享受生活。4.健康好，防運動量不足、發胖。5.可以經營家庭事業或自己開店營利。",
      "交友": "1.健康好脾氣、與人好相處，容易散發親和的肢體語言。親切、魅力（疾厄-交友的福德）。2.異性間防耳鬢廝磨而擦槍走火〈桃花星〉。3.店面人潮多，可從事咖啡、茶藝、餐飲、休閒行業。 4.適合予人愉快的服務業。",
      "事業": "1.2.工作場大、舒適。店面越舒適生意越好。3.生活條件優渥、愛享受，最容易心寬體胖。防過胖，享受現成。4.5.家運好，懶人有懶福。可以經營家庭事業。適合生產行業（會偏財權尤佳）。也適合生產行業（會偏財權尤佳）。",
      "命宮": "1.懶散、不想多動、也容易發胖。2.家運好、少操心擔當、生活條件優渥、享受現成。心情常好。懶人懶福。3.工作地方〈店、工廠、辦公室〉舒適。4.緩散有福，少久病糾纏。但防慣於養尊處優。5.容易相處、好商量、好人緣（疾厄-交友的福德宮）。6.媳婦緣好。小孩也異性緣早來。7.格局好，店面越做越大。大店面，生意好。",
      "財帛": "1.風花雪月財、賺軟錢〈桃花星〉。2.少流汗、不辛勞的賺錢方式〈祿照福德〉。容易現金收入。3.物質生活優渥。悠遊享受。4.沒有理財觀念。5.逢對時機的財路。",
      "福德": "1.懶得動怕流汗，很容易發胖。不積極。2.無久病之磨，小病好醫、大病好死（少痛苦之磨）。病痛最容易逢凶化吉。3.家運好、家安宅吉。好情緒。4.物質生活好，優渥享受（家運好而物質高）。但防耽于逸樂而少衝勁。5.可從事生產行業（偏財星，會權尤佳）。",
      "遷移": "1.多旅行、好冶遊。性逍遙、閒情逸致。享受現成。心想事成。2.喜歡新鮮感受、流漣美好情境。3.容易放鬆，忘志、少了積極責任。4.福厚少災、好事臨身。一生少久病折磨，有病也容易得貴人，遇難呈祥。5.喜歡人家奉承、侍候。但也擅長自我調試、隨遇而安。6.修行人放下、自在〈宗教星〉。7.逢偏財星會田宅、兄弟、財帛之權，發財甚速。"
    },
    "權": {
      "子女": "1.多動不耐靜、最喜歡溜搭。2.健康、性能力強。3.對小孩管教容易命令式的粗魯不當。",
      "夫妻": "1.身強體健、持續運動容易是運動員〈夫妻為疾厄的田宅─收藏宮〉。2.健壯〈美〉，活力、好動。3.性能力好。4.可從事生產行業（偏財星會祿尤佳）。",
      "父母": "1.言行魯直、臭屁，容易衝動、特立獨行。加忌則口無遮攔、大嗓門、惡言、修養差。2.宜讀聖賢書，則仗義直言。或培養專業、專技，滔滔辯才、行動力強。",
      "兄弟": "1.活力、健康、運動、健身。2.耐力、抗壓。肯拼敢賺。可以高收入。3.個性粗曠、乾脆、主動〈權沖交友〉。",
      "田宅": "1.家運興旺。可經營家庭事業。2.喜歡明亮、寬大空間。3.健康、活力、少病痛，持續性的活〈運〉動。",
      "交友": "1.活力、健康狀況好。2.與人相處較主動、大方。格局差，粗魯、臭屁。",
      "事業": "1.身材健壯。愛運動、多為運動員。2.個性粗線條、活力、乾脆。3.工作場大。店面大反而生意好。4.重物質生活。5.可以從事生產行業（會偏財祿尤佳）。",
      "命宮": "1.天生耐操、健壯，抗壓性。2.體質好。小病少，抵抗力強。活力、愛運〈活〉動。3.家運強。格局好，可以選擇大店面做生意。4.敢拼敢享受，重物質生活。5.適合運動量大的工作。6.持續運動，一生極少病痛。",
      "財帛": "1.賣體力的辛苦錢、肯操勞的收入。2.身體越操越健康（權照福德）。3.4.局挑戰性的工作。5.敢操敢享受，重物質生活。",
      "福德": "1.健壯、少病。多動、耐勞、幹勁。2.個性粗曠，大口酒肉、痛快、滿足。蠻勁、自信膽大。少病痛。3.會祿，防多肉欲、暴飲食〈貪狼〉。格局偏頗，特立獨行。4.可從事生產行業（偏財星，會祿尤佳）。",
      "遷移": "1.身體健壯、活力、抵抗力強，好動、抗壓、蠻皮、膽大鎮定。2.個性粗線條、乾脆、憨膽、大方、蠻勁。也容易特立獨行。3.工作場大。適合生產行業（偏財星會祿尤佳）。"
    }
  },
  "財帛": {
    "忌": {
      "子女": "1.格局好，疼子女、捨得花錢。格局差，小孩必須承擔經濟，本身也不會精打細算。2.庫漏不蓄、有錢存不住、退敗、不善理財、防人生多起伏、難守成、防財路中斷〈沖田宅庫位〉。事倍功半。3.4.不宜合夥。（注",
      "夫妻": "1.婚姻平淡少味（財帛-婚姻對待，少趣）。2.最好各自理財。免為財傷感情。3.4.不宜囤貨、壓本，宜現金、回收快的生意。或少風險的仲介、技術、顧問、代書、會計等服務業。5.不宜投機、賭。6.適合上班固定薪資或穩當小生意（沖事業）。也適合薄利的買賣（事業忌出）。",
      "父母": "1.不善理財做帳。花錢少思考或指出多、防口袋的錢放不熱，容易花掉。也防收入不穩（沖疾厄-容易流失財源）、事倍功半。2.格局差，防入不敷出、信用破產、銀貸難償，人生多起伏、難守成。3.運限差時，經濟差，需銀行借貸、朋友調度、互助會周轉。容易捉襟見肘。4.人欠我金錢，很容易被倒賬。做生意以現金往來最佳。5.很容易有長期銀貸。（注",
      "兄弟": "1.勤快、儉約、儲蓄、守成、安定。有長子格。2.適合上班族，可能加班、兼差。也適合現金生意〈忌，點滴累積〉。老闆兼夥計。3.格局好，勤儉致富、小生意賺大錢。4.個性內斂，對朋友不多情，少社交〈沖交友〉。5.",
      "田宅": "1.儉約、儲蓄。點滴累積、辛苦錢。2.守成、安定。常為上班族的固定收入，或現金生意〈忌，點滴累積〉。3.格局好，勤儉致富、積沙成塔。4.對朋友不多情，少社交〈沖交友三方〉。5.",
      "交友": "1.惜情重義、仗義疏財、漏財不蓄、不善理財、支出多。運限不佳時，防手頭不方便、經濟窘困（沖兄弟庫位）。2.或利潤微薄、惜情少賺，賺錢不得要領、事倍功半〈沖庫〉。3.命格差，入不敷出、收入不穩，還防欠債背信、防人生起伏大、難守成。4.少與人太多的金錢借貸往來，防交友無義，人去樓空。5.不宜合夥，容易找到行黴運的合夥人。（財帛為交友的田宅，財忌入友易碰上窮對象。）6.不適合創業，上班較安穩。",
      "事業": "1.不適合資金大、回收慢的生產行業。2.適合不囤貨、壓本的小本生意或買賣、仲介、技術、顧問等服務業。3.最好上班族固定薪資。4.不宜賭、投機（沖夫妻福分財）。",
      "命宮": "1.賺血汗錢或利潤微薄的小生意。最適合於上班固定薪資。忌者常主固定。常為五斗米折腰。2.格局好，必也辛苦之得；格局差，則常為錢苦急、為財所役、求之不可得。3.或有討厭為錢傷腦筋而不愛理財，也沒有金錢概念。4.宜精打細算、開源節流、不辭勞苦。5.逢偏財星化忌，防好賭及沉迷酒色而自作其孽。（注",
      "疾厄": "1.個性節儉、勤快、算計、毫不浪費。錢花在刀口上。有長子格。2.賺辛苦錢，為財勞碌。老闆兼夥計。適合生活必需品的銷售。3.個性內斂，對朋友不多情，少社交〈沖交友三方〉。4.適合現金生意〈忌，點滴累積〉。5.格局佳，積沙成塔、小生意賺大錢。6.",
      "福德": "〈財帛忌出〉1.重享受、捨得花用〈是選擇性的花在自己喜歡的事物上，執著欲望〉。2.格局差，口袋留不住錢、錢多帶多花用、不善理財、亂花錢。運限差，為錢苦急。3.4.最不宜賭、毒、酒、色等不良嗜好，防顛迷頹廢、自作其孽。",
      "遷移": "1.個性拙樸、憨直、不善汲營、不善攀緣、憨厚少心機算計、賺錢能力較差。2.3.上班較穩當，少做生意為妙。4.迷糊、後知後覺。5.時運不濟的時候阮囊羞澀、窘態畢露。6.千萬勿冒風險、及賭、投機。"
    },
    "科": {
      "子女": "1.支出多有計劃。2.給小孩零用錢有節制。",
      "夫妻": "1.理財互有商量。",
      "父母": "1.理財做帳、收支平衡。2.容易分期付款。",
      "兄弟": "1.理財儲蓄。積蓄不多、足用應急。",
      "田宅": "1.2.理財量入為出，收支平衡。",
      "交友": "1.君子的小額通財〈適可而止〉。2.支出多有計劃。往來信用良好。3.容易分期付款。",
      "事業": "1.平順就是福，勿貪大、勿求高利潤。2.宜文宣、廣告工作。3.宜上班族安穩。",
      "命宮": "1.細水長流財，適合小生意或薪資收入。2.量入為出。",
      "疾厄": "1.口袋不多裝、剛好夠用。2.",
      "福德": "1.平實無華、少欲無災。",
      "遷移": "1.理財、用錢有計劃。宜上班族。2.容易調現。"
    },
    "祿": {
      "子女": "1.給子女充裕的零用錢〈防寵溺〉。為人也較少計較金錢。2.現金方便，少理財計畫而多花用。3.宜向外求財，應加強業務〈不適合等客上門〉。4.有合夥象（未必賺錢）。5.金錢孝敬父母（子女-父母的財帛）。",
      "夫妻": "1.對配偶不計較金錢。理財互信多商量。2.賺錢順暢、來財容易〈祿照事業〉。很適合見利快的買賣業（事業祿出）。3.默契好，婚姻多和樂。結善緣而來的婚姻（財帛-婚姻的對待位）。4.婚後財務順暢，很容易置產安家〈夫妻為田宅共宗六位〉。5.適合業務、銷售〈財帛祿照事業〉。6.也適合精品、藝品、飾品等貴重物品銷售。",
      "父母": "1.與銀行多金錢往來。也容易與人多金錢往來（譬如互助會、做生意的人）。2.與人金錢往來信用良好。3.金錢供養父母。與外（夫）家多金錢往來。4.也容易是銀行行員、理財專員、代收賬款、公司會計。",
      "兄弟": "1.進財順暢、收入好。2.來財容易，經濟優，日有所增或財源綿長。〈增進象〉3.適合高薪、分紅薪水。也適合創業、做生意（會權尤佳）。4.與兄弟少計較金錢。給小孩零用錢充裕（兄弟-子女的福德）。5.",
      "田宅": "1.來財容易、財源綿長（福入收藏）。容易發財格，常非汲營勞累之得。2.蔭家庭、少計較、收入好、家境優。會權可以收入倍增。3.容易與父母同住〈財帛為父母的疾厄宮〉。4.可高薪、業績分紅薪水。也適合做生意。5.容易購屋置產。〈增進象〉",
      "交友": "1.手頭方便而較多支出〈未必富有〉、但防缺少理財觀念。2.人緣熱絡，與人金錢往來多而少計較。3.錢財往來信用好、風評佳。4.格局差，還防外華里虛；逢交友坐忌則肉包子打狗（祿忌成雙忌）。5.很適合人潮、變現快、迴圈投資的現金生意，或口碑取勝的服務業。也適合大賣、直銷方式的銷售。6.適合賣場、專櫃、店員等金錢過手的上班族或銀行行員。（注",
      "事業": "1.生意好，資金周轉快、生意越做越順。盡人事而後不求自得。〈注",
      "命宮": "1.樂觀有福、財神爺喜歡你〈非必全由自己賺得〉。來財容易、現金方便〈未必富有〉。但防樂不思蜀、滿足現狀。2.容易高所得或來財容易，不宜固定薪資，宜業績分紅薪水。3.現金緣好，適合業務、銷售等工作及現金生意（現金緣好，直接見利）。4.5.祿喜權會，則機遇會更劄實、拓展的空間更大。會科則財源綿長，會忌則踏實而辛苦多得。〈注",
      "疾厄": "1.來財輕鬆、賺錢容易、財源綿長（非必自己賺得）。2.少流汗、不辛勞的賺錢方式〈祿照福德〉。容易現金收入。3.物質生活優渥。悠遊享受。4.沒有理財觀念。5.逢對時機的財路。",
      "福德": "〈財帛祿出〉1.福厚財自來，福報好、四方來財、來財容易、常不求自得〈非必全由自己賺得〉。2.一生衣食豐足，金錢不虞匱乏。逢山窮水盡也都柳暗花明。3.樂觀不計較，好商量，隨緣、不汲營，凡事多往好處想（福德祿出）。4.懶得算計、不強求，卻多順遂如願、享受、器量大。5.格局好，能以興趣為業，快樂賺錢。6.適合才華、心靈、精神、文化、宗教等工作。也可從事休閒產業、流行時尚、娛樂事業。可以多樣化經營。7.最好能以熱衷的興趣為業，盡人事則常福至天成。",
      "遷移": "〈財帛祿出〉1.格局好，財源活絡，手頭方便〈未必富有〉。少計較。2.現金方便進出多、周轉變現快。來財容易，只要用心，錢財垂手可得。3.適合現金生意的日日見財。4.外緣好、廣得人和、信譽也佳。5.善理財，可以錢滾錢。6.適合業務、公關、銷售工作或出外好賺錢。也適合精品、飾物、古董銷售。7.格局較差者，中看不中用，也容易是銀行行員、財務經手人員。"
    },
    "權": {
      "子女": "1.金錢成就〈栽培、幫助〉子女。2.敢花錢、有面子〈不見得有裡子〉。還防浪費。容易大筆支出（權）。3.格局差，防金玉其外敗絮其中。",
      "夫妻": "1.雙方配合理財可更順遂。婚後收入可以更高。2.主動積極、賺錢順利〈權照事業〉。適合大宗的買賣業（事業權出-近利的過手獲益）。3.容易置產安家〈夫妻為田宅共宗六位〉。4.逢偏財星，投機、意外財（會祿尤佳）。5.也適合精品、藝品、古董及貴重物品銷售。",
      "父母": "1.與人多金錢往來。2.金錢往來信用好、金額大。3.好面子，放浪費、多花用。格局差，防金玉其外敗絮其中。4.容易是銀行行員、理財專員。",
      "兄弟": "1.富活力、積極，容易開創。2.3.宜專業、專技，可高收入。4.可高薪、分紅薪水或創業。",
      "田宅": "1.有活力與企圖心。2.理財、活用、經營、開創，可以收入高、創造財富。會祿更如意。3.專業、專技，更具拓展空間。4.高薪、業績分紅薪水，也適合創業。5.容易裝潢、增建宅屋、再置產，換更大的房子（增進象）。",
      "交友": "1.敢花錢、好面子〈不見得有裡子〉。2.3.活躍、金錢助人，小心金錢露白，招盜引賊，也防浪費、多花用。4.適合大筆批發或高價位生意。也適合賣場、專櫃的上班族或銀行櫃員。",
      "事業": "1.積極、拓展（經常性的投資迴圈象）。容易生意越做越大、資金越滾越多。2.容易高薪、高職，宜業績分紅薪水。3.也容易升遷、創業。4.最好專業、專技，市場的開發、領導等工作。4.權喜祿會，則機遇會更好、拓展的空間更大。",
      "命宮": "1.積極、自信、拓展。能力好、有作為。2.可以高收入、高利潤。3.適合開發、領導與銷售的工作，利於升遷、創業。4.最好擁專業、專技，可以高薪、高職，宜業績分紅薪水。5.權喜祿會，則機遇會更好、拓展的空間更大。6.能高薪、高職，宜業績分紅薪水。（注",
      "疾厄": "1.積極、活力、幹勁。不怕勞累，可以好收入。2.個性主動、乾脆。具耐力與抗壓性。敢賺敢花。3.適合技術性粗活、打拼之才。4.格局好，大筆錢收入。可高薪、高職或業績分紅薪水。5.也可以創業，但容易老闆兼夥計（權入疾厄-勞其筋骨）。（注",
      "福德": "1.金錢欲望大、想賺大〈快〉錢。喜歡口袋裝飽。敢賺多花。行動力強。2.積極、幹勁，防好大喜功。3.容易以金錢滿足欲望（福德-財帛的表像位）。4.多重物質生活。防奢華、浪費。5.宜專業、專技、特殊巧藝。6.也適合精品、藝品、古董及貴重物品銷售。",
      "遷移": "1.格局好，支出能力強或信用佳。2.積極、自信，擁專業、專技或特殊技能，收入更好。可以建立口碑。3.格局好，善汲營，容易大筆錢進出。4.格局差，有面子沒裡子，防重看不重用、財大氣粗。或為銀行理財專員。5.也適合精品、古董、藝品及貴重物品銷售。"
    }
  },
  "福德": {
    "忌": {
      "子女": "1.偏執的小器量。2.多偏頗執著的操心子女、防代溝。3.自己也在家呆不住。4.沉迷色欲不擇食（桃花星）。5.慈悲喜舍、根器〈宗教星〉。",
      "夫妻": "1.偏執的愛，對感情強烈的專注、執迷。加權，防愛之欲其生恨之欲其死。2.格局差，防執迷桃花而拋夫〈妻〉棄子、情聖〈感情過剩、盛〉（貪狼、廉貞桃花星尤顯）。3.勿賭、投機〈夫妻─福分財，不厚〉。4.",
      "父母": "1.偏激躁烈、出言不遜〈加權尤劣〉、不學無術。愛恨激烈。不愛念書、不受教。斯文掃地。偏執小器量。2.厭惡繁文縟節、不愛禮教束縛。3.4.5.運限差時，防病痛傷殘（沖疾厄）。6.慈悲喜舍（宗教星）。",
      "兄弟": "1.格局差，為人偏佞、無情、狹隘、自私自利〈沖交友〉（福不可入收藏宮，福藏則無德可延）。2.兄弟退財〈福德─兄弟的田宅〉。3.防早衰。不性福。4.（注",
      "田宅": "1.偏執的叮嚀、嘮叨，與家人不好相處。2.3.格局差，長久難戒的不良嗜好、玩物喪志的惡習、特殊癖性（入收藏宮）。4.祖德無芳、家宅欠寧。5.6.最宜修習慈愛、智慧、哲理（福固不可入收藏宮，福藏則無德可延）。（注",
      "交友": "1.怕孤獨、寂寞。但防偏執、憑感覺的人際對待。偏執小器量。偏執的用情。2.多偏執性的人際交往。3.修行者的慈悲喜舍、無畏佈施〈宗教星〉。",
      "事業": "1.最好能以興趣為業。否則也容易職業倦怠。很適合專注、研發的工作。2.小器量。龜毛自擾。3.命格差，入錯行、用錯心，失望、挫折、天不從人願等諸多困擾或事倍功半。4.宜一技在身，也可以從事精緻、美學、才華、心靈、宗教、精神、文化事業。5.適合上班安穩。6.7.",
      "命宮": "1.業力較重。多憂常惱或庸人自擾。格局佳，亦多竭盡智能、多苦勞少功勞。2.或不良嗜好無力戒除，傷財傷身（忌入命）。3.命格差者著於愛恨、偏執喜樂。甚或癡迷狂漫的少了智慧。最愛得遷移、夫妻、子女飛祿來會，以因果之福緩禍或擇善。狹隘小器量。多計較。適合修心（行）。4.勿賭、投機，少妄想不勞而獲。5.譬如福德飛出之忌或轉忌逢武曲正財星者，常為金錢分毫計較的視財如命，致令親疏朋離。6.又譬如福德以廉貞、貪狼忌入命、疾厄，常意亂情迷、貪花戀酒，或沉迷賭、毒，難以自拔〈需要雙忌以上的破格方顯〉。7.格局差，防病痛折磨、業力糾纏。〈注",
      "疾厄": "1.樂好不疲、耿懷龜毛，乾淨潔癖、愛美整型〈太陰星〉。孤僻嗜性。2.格局差，玩物喪志、焦慮自殘、偏枯僻性、沉迷嗜好等，或有荒工廢業、自陷孽禍、自閉、過動而不好相處。3.憂疑健康。格局差，業力病糾纏。4.苦行修持、身心合一〈宗教星〉。5.不容易相處，只喜歡找臭氣相投的朋友。（疾厄-交友的福德）。最宜親近善知識。6.但防長子的人際交往狐群狗黨（福德-子女的交友宮）。",
      "財帛": "1.格局差，為財煩惱、為錢傷神〈缺錢難過〉。一籌莫展。2.或有精打細算、愛財如命、貪小便宜〈逢武曲正財星化忌，最容易是守財奴的斤斤計較〉。偏執小器量。3.執一而棄萬的興趣變化、不和喜好則少耐性。防性格狹隘、偏執算計，而親疏朋離。4.或有投機好賭、嗜財算計，招惹孽禍。5.薄福、損福。格局差，但防災厄、殘傷、損壽〈福德忌出〉。",
      "遷移": "1.個性愛恨激烈、衝動、暴戾、殘忍。容易招惹是非、遭災引禍。2.個性浮躁、怨天尤人，或少深謀遠慮，容易壞大事。少思維、憑感覺、直截了當。3.福薄、折福，防災厄、業力病、損壽、孤寡、怨尤、不如人意。4.最宜簡約惜福、修心養性〈福不足〉。5.勿賭、投機。6.修行者，無緣大慈、同體大悲〈宗教星〉。小器量，最宜修持德行。（注"
    },
    "科": {
      "子女": "1.悠悠天性、精神教養。",
      "夫妻": "1.談感情較重氣氛與感覺。加祿",
      "父母": "1.修養好，談吐悠雅。格局差，但防嬌柔做作。2.謹言慎行。長輩貴人。",
      "兄弟": "1.儲蓄、保險，備而少憂。2.養生、保健。",
      "田宅": "1.量入為出，多慮少失。家中常備不時之需。2.重精神生活，恬淡簡樸、書香繞宅。",
      "交友": "1.君子淡交，溫良恭儉讓。",
      "事業": "1.適合從事心靈、文化、哲學、休閒事業。",
      "命宮": "1.修心養性、安適恬淡。2.內涵、品味、清靜。〈菜根譚",
      "疾厄": "1.舉止悠雅、不疾不徐、慢條斯理（加祿尤顯）。處事謹慎。2.溫文、平和、優柔。",
      "財帛": "1.金錢欲望淡薄、收支平衡。2.小額金錢周轉容易。",
      "遷移": "1.修養好，有品味。2.心平氣和、涵養好，多得貴人。3.可接觸宗教、哲學等心靈之學。"
    },
    "祿": {
      "子女": "1.個性喜歡小孩、天倫快樂。慈心善真、福蔭子孫。也容易有子孫福。2.對小孩和悅放任，但防寵溺太過。3.自己喜歡往外跑。4.防好色。祿為喜歡、忌為沉迷。5.善良、壽相，很容易逢凶化吉（子女-福德的共宗六位）。6.慈悲喜舍、根器〈宗教星〉。好器量。",
      "夫妻": "1.對異性多感性、柔情。但防多情怠志、每每容易沉醉溫柔鄉，婚後諸多順遂。2.但防多情而容易沖昏理智的見異思遷，產生劈腿、婚外情。3.祿照事業，賺錢順遂。配偶事業亦順遂（福德-夫妻的事業）。人生總是諸多如意。4.工作或賺錢，應多找異性物件為客戶最佳。5.逢偏財星，容易中獎、意外財、橫發。6.少禍事且容易逢凶化吉。福厚衣食無憂。",
      "父母": "1.和顏悅色，歡喜溫和。幽默可人。2.祖上有餘蔭、父母有祖蔭。3.親近尊長。興趣廣泛，但防多學少精。4.喜歡說好話。含和溢表。好脾氣器量。5.",
      "兄弟": "1.重兄弟情、沒有計較（近乎有容乃大）。2.福厚居財，金錢、事業順遂。3.福厚少病、健康多壽。4.夫〈妻〉、子兩悅。5.樂觀知足，少汲營計較，但厚福自足。兄弟家庭亦經濟豐足（福德-兄弟的田宅）。6.逢偏財星，發財甚速。得權增益積極企圖。",
      "田宅": "1.旺家益宅、福蔭子孫。2.祖德流芳或祖上曾經發達。3.和氣入室、家安宅吉、歡喜天倫、享受生活、福蔭子孫。衣食豐足。4.少有認真理財，但容易不虞匱乏。5.和睦宗親、親情濃厚。6.風生水起蔭福宅。逢偏財星，橫發。喜會權，增益其積極性與企圖心。",
      "交友": "1.喜歡熱鬧。樂觀親和、歡喜待人。以興趣、樂趣會友。喜歡說好話。2.熱情，把歡樂愉快氣氛感染給周邊的人。朋友常有樂同享。寬以待人、老少鹹宜。3.多情少計較、不計嫌、好脾氣。4.物以類聚，喜歡跟樂觀、快樂的人做朋友。器量大。5.與配偶相處愉快（交友-夫妻的疾厄）。",
      "事業": "1.隨緣自在，防非積極、不夠敬業。2.福厚如願，福至心靈、心想事成。3.適合寓興趣於工作。器量大、興趣廣。5.適合園藝、餐飲、休閒產業，也可以從事才華、精神、心靈、娛樂、旅遊、咖啡、茶藝、流行時尚等工作。5.配偶工作如意（福德-夫妻的事業）。",
      "命宮": "1.福報好、樂天知命，樂觀少計較。個性也容易凡事往好處想、編織美夢。2.安逸有福、常不求自得、心想事成。衣食豐足。喜歡悠閒。善自我調試。3.容易遇難呈祥或禍不臨身。4.具壽相、晚景優。器量大。興趣廣。5.少久病惡疾之磨。6.適合藝術、才華、心靈、文化等精神工作，也可從事休閒、旅遊、時尚等事業。最好寓興趣於工作。7.逢偏財星，中獎、意外財，不勞而獲。",
      "疾厄": "1.心寬體胖、享受悠閒。懶散、逍遙、不起勁、不想流汗、好情緒。2.身心自在、隨遇而安。家運好，懶人有懶福（天塌下也自有人頂）。3.4.福厚少病。興趣廣而少專精。善於自我調試，也多感性、溫和，好相處。5.偏財星，心想事成，發財甚速（會權尤顯）。",
      "財帛": "〈福德祿出〉1.福厚財自來，福報好、四方來財、來財容易、常不求自得〈非必全由自己賺得〉。2.一生衣食豐足，金錢不虞匱乏。逢山窮水盡也都柳暗花明。3.樂觀不計較，好商量，隨緣、不汲營，凡事多往好處想（福德祿出）。4.懶得算計、不強求，卻多順遂如願、享受、器量大。5.格局好，能以興趣為業，快樂賺錢。6.適合才華、心靈、精神、文化、宗教等工作。也可從事休閒產業、流行時尚、娛樂事業。可以多樣化經營。7.最好能以熱衷的興趣為業，盡人事則常福至天成。",
      "遷移": "1.歡樂、逍遙、開朗、溫和、好脾氣。無所謂、少計較、容易隨遇而安。凡事往好處想。容易自我調試。2.喜歡新鮮的事、物，喜歡外面溜搭、喜歡熱鬧，怕寂寞。隨緣好相處。3.還防太過感性的迷情惑境、移情忘志。少了積極性、責任心耽誤了前程。4.重蹈覆轍、愛做夢、耽于逸樂。5.有福，遇難呈祥、大事化小。壽相、老運好。6.逢偏財星，容易中獎、意外財。橫發。7.善念與修行的放下、自在〈宗教星〉。（注"
    },
    "權": {
      "子女": "1.斯巴達式教養、絕對的服從。2.望子成龍、欲鐵成鋼。3.喜歡在小孩面前說臭屁話、出口訓誡。",
      "夫妻": "1.對感情的佔有、支配欲強。戀愛攻勢強勁、婚後約法三章。2.如果用心於事業將獲成就，但防好高騖遠〈權照事業〉。格局差眼高手低。3.逢偏財星，容易中獎、意外財、橫發。（注",
      "父母": "1.活耀、傲骨、愛現、愛說占上風的話、說大話。虛榮〈加祿〉、燥烈不馴、傲慢無力、目無尊長〈加忌〉。2.最好習得專業、專技則談吐有物。3.格局好，求知欲高；容易習得智慧、哲理。4.格局差，防貢高我慢、逞口舌快意、理想高而卻眼高手低、死要面子。",
      "兄弟": "1.強出頭于兄弟間，防與兄弟多爭不讓。2.多思進取，積極、幹勁。格局差，防好大喜功。格局佳，逢偏財星，發財甚速。3.最好專技、專業、可以開發、創造、拓展。逢祿尤順。4.5.健康、活力、意志力。",
      "田宅": "1.祖上曾經有能者。祖父輩家宅興旺。2.宅內強出頭，或斯巴達式的管教。對家〈人、產〉護持心強。3.活力、積極、開創，旺家興宅、擴張產業。逢偏財星，橫發，會祿尤顯。4.講究物質生活、著重門面而開銷過大。5.會祿增益順遂，但防奢華太過。",
      "交友": "1.表現欲、好面子。多海派、豪氣。格局差，臭屁、高姿態。2.喜歡結交豪門貴族。3.4.格局差，狗眼看人低、為虎作倀。傲慢失禮。死要面子。5.喜歡支配配偶。",
      "事業": "1.2.積極、幹勁，多交際、應酬。容易創業。行動力強。3.最適宜專業、特殊技能、獨門生意。也適合企劃、創造，推陳出新。4.格局差，防好高騖遠、眼高手低。5.配偶事業有成。",
      "命宮": "1.積極、有福、意志力強。格局佳，行動力強，得嘗宿願。生命力也較強韌。2.格局佳，講求實務，企圖、鬥志與不服輸。格局差，傲骨、自大。3.擁專業、專技更佳。有拓展空間。4.重視物質生活。",
      "疾厄": "1.活力、多動、幹勁，抗壓性足。2.很適合耐力、膽識的專技、挑戰性工作。3.敢吃苦、敢享受。講究物質生活。4.逢偏財星，橫發、如願。",
      "財帛": "1.金錢欲望大、想賺大〈快〉錢。喜歡口袋裝飽。敢賺多花。行動力強。2.積極、幹勁，防好大喜功。3.宜專業、特殊技能、創造風潮生財。4.逢偏財星，投機、偏發。",
      "遷移": "1.藝高膽大、聰明機靈，容易自信、傲骨，自恃甚高。還防只是浪得虛名，看高不看低。不自量力。格局佳，主動積極，行動力強。2.防奢華、浪費。3.逢偏財星，中獎、意外財。橫發。4.修行者，根器高、勇猛精進〈宗教星〉。"
    }
  },
  "遷移": {
    "忌": {
      "子女": "1.晚輩面前形象不佳、對子女的管教不當〈或不得要領〉。2.奔波驛馬、無定驛馬、東奔西跑〈防勞而無功〉（沖田宅收藏宮）。狹隘小器量。3.容易迷路、也防意外災傷、是非橫禍。4.宜加強修養，閒事少理、莫道他人長短，最容易招惹是非、懷璧其罪。少貴人。5.也防冷漠人事孤獨。",
      "夫妻": "1.不被祝福或平淡的婚姻。2.不善偽飾、不會甜言蜜語。3.4.勿賭、投機。",
      "父母": "1.孤陋寡聞或個性靦睍、封閉、木訥。表達能力差。後知後覺。不善轉圜。2.不喜攀緣或冷漠孤癖，社會關係差。3.或對人事的理解、反應能力較差，常人云亦云，容易盲從、瞎猜。4.命格差，或有行為乖僻、涵養不足、離經叛道、不理性、不受教。5.出外防意外、罰單，也容易糾纏文書問題。6.阻礙或不利於念書、考試。7.但防個性冷漠而不易親近。狹隘小器量。",
      "兄弟": "1.社會資源較差，須白手起家、獨立奮鬥。格局差，天欲亡我經濟、事業、健康。2.不善袖舞、不善攀緣（沖交友），機遇較差。3.福運差，不得投機、好高騖遠、冒風險，天上不會掉下禮物。人算不如天算。4.5.亟需理財做帳，縝密財務。6.7.適合上班安定。",
      "田宅": "1.家族社會關係不佳，還防家道中落。2.離鄉背井、不守祖業、他鄉作故鄉。3.4.小心門戶，還防賊盜、天災、人禍。5.勿賭、投機。很容易外來因素敗產。還防家運不濟。6.更防老來形單影隻〈子息少或子孫各奔東西〉。或有老來淒冷病疾（福德九沖六位）。7.終究需防門前冷落車馬稀、世事難料人氣寒。",
      "交友": "1.不愛熱鬧、不善交際、不喜逢迎攀緣。孤獨個性。狹隘小器量。不善轉圜。2.遺世獨立、享受清靜。格局差，還防憤世嫉俗、臨急少貴人。",
      "事業": "1.不善攀緣或不喜逢迎。狹隘小器量。2.閒事少理、還防小人、意外、阻撓、倒楣、不名譽等情事。天不從人願。3.際遇不佳，容易人事紛擾、橫生枝節、吃力不討好。宜謹言慎行、勿強出頭。4.運輸業、司機、遊牧式的工作環境。5.逢廉貞化忌，防官非、血光。6.不適合冒風險，不宜賭、投機。〈注",
      "命宮": "1.不善攀緣、不喜迎逢。社會資源差。2.也不可招搖、雞婆，容易遭誣陷、惹麻煩。3.際遇不佳，防莫須有的招災惹禍、破財、傳染病。天不從人願。防一籌莫展。4.少作投機、賭，別妄想不勞而獲。5.宜謹言慎行、還防懷璧其罪。6.格局破，孤獨僻性、固步自封，少交遊、無迎逢，人氣寒而知己稀。狹隘小器。7.容易先自設立場，不喜歡欠人情債或特殊癖性。不能隨遇而安。8.驛馬，容易離鄉背井（未必外出有成）。9.老運防孤、寡，子孫無力（業力）。10.格局差，防意外、業力病，以及人生挫折、壓力、自閉等諸多苦趣臨身，此皆業力使然。此刻如得福德、夫妻、子女飛祿（因果之善）入命來會（同星曜尤佳），可轉成福厚困自解。（注",
      "疾厄": "1.奔波驛馬，汲營勞忙性不閑。2.生活緊張、團團轉、身不由己。本身個性也少能隨遇而安。不喜歡太多外宿。3.危險性高的工作。但防災厄、職傷、過勞，流行病毒、意外。4.5.格局差，業力病〈雙忌以上〉。6.",
      "財帛": "1.格局差，不善攀緣或不喜逢迎。防財路狹隘、無力開源。狹隘小器量。2.社會資源差、際遇不佳，閒事少理。3.4.格局差，防金錢壓力、窘態畢露。5.6.天不從人願，千萬勿賭、勿投機。7.配偶容易是固定薪資或小生意的賺辛苦錢。",
      "福德": "1.偏離常態之癖嗜、癖性，容易作繭自縛、招災惹禍。格破則孤寡。2.容易糾纏業力，防意外、乖違、災病、損壽。逢廉貞化忌，防血光、官非。巨門化忌，防意外、瘤癌、是非小人。3.還防嫉世憤俗而不得自在。孤僻冷漠而不能隨遇而安。狹隘的偏激喜惡。4.千萬勿賭、投機。福不厚，最宜修心養性。5.修行人"
    },
    "科": {
      "子女": "1.小輩面前形象好。",
      "夫妻": "1.舊情悠悠或相思兩地愁。2.加祿，容易有迴腸盪氣的一段感情。",
      "父母": "1.活到老，學到老。2.聲輕言慎，防矯柔作飾、沽名釣譽的外在形象。",
      "兄弟": "1.逢凶化吉，大事化小（健康）。",
      "田宅": "1.住宅環境安靜雅適。2.祖上或有仕紳聞人。",
      "交友": "1.往來皆文士，逢迎盡風雅。2.3.朋友久失聯仍搭上線。他鄉遇故知。悠悠故人情。",
      "事業": "1.容易逢貴人。",
      "命宮": "1.處世溫文、謹慎、慢條斯理。修養、品味。2.得貴人、名聲。",
      "疾厄": "1.出外逢凶化吉。處事小心、謹慎。",
      "財帛": "1.涓涓滴流，不無小補。宜上班族。2.容易調現。",
      "福德": "1.平和、細膩的思維舉止。行事謹慎、不疾不徐。2.近智慧，可接觸宗教、哲學、義工等心靈指導〈宗教星〉。"
    },
    "祿": {
      "子女": "1.小輩面前形象佳，親和力好。2.或人際往來多小輩對象。容易寵小孩。3.驛馬。在外時間多，容易流連忘返。也容易是非定點的來去驛馬。4.運用社會資源庇蔭子女。5.老運好。老來不孤寂，容易兒孫相伴（孫子祿入兒子）。也容易有發達子孫象。6.7.具善根、善緣〈宗教星〉。器量大。",
      "夫妻": "1.容易懈逅情、風花雪月情，防得來容易的成為多情種子〈桃花星〉。也容易招手成婚。2.形象好，容易得異性青睞。逢廉貞、貪狼桃花星，魅力十足，還防處處留情。3.特種行業桃花財〈桃花星〉。4.際遇好〈祿照事業〉。也容易逢凶化吉。5.往來人際交情異性勝於同性。6.逢偏財星，中獎、意外財。橫發。（注",
      "父母": "1.外在緣好，學習快、反應佳，現學現賣。八面玲瓏。見多識廣。2.格局佳，見多識廣、圓融和，善察言觀色、投其所好而處事圓滿。器量大。3.容易與長輩〈長官〉或社會上層人士攀緣。4.格局差，逢迎附和、虛偽讚歎。表面功夫。5.格局差，防喜歡他人奉承或多巧言令色，喜歡好聽的表面話。浪得虛名。6.7.考運好、手氣佳、反應快。學習緣好。學習能力強。善轉圜。8.",
      "兄弟": "1.際遇好，賺錢機會多。或善交際、容易攀緣牟利。（遷移為因緣、福運位）。2.可八方來財、財源廣進，最宜業務、公關的推展工作。3.容易運作社會關係，社會資源惠我良多（遷移為社會，人生舞臺位）。4.天降其福，容易心想事成，也會無心插柳柳成蔭。逢偏財星，發財甚速會權尤佳。5.健康良好、有病常得貴人（福厚）。6.利於升遷、創業、從商。7.偏發、投機〈偏財星〉。",
      "田宅": "1.外地緣好、出外機遇多。離祖可發跡。2.驛馬、容易他鄉變故鄉，可以發達異鄉，也容易在外地置產。能夠衣錦還鄉。3.緣善福厚，容易旺家蔭宅、五福臨門、天降橫福、得助置產、發財發福。常無心插柳柳成蔭、田僑仔。〈逢偏財星會權尤佳〉。可以光宗耀祖。4.開店地段好、生意好做、八方來財。5.戀親念舊。老運亨通、子孫滿堂〈遷移宮─孫子位〉。6.鄰里和睦。家安宅吉。7.祖德流芳，或祖上有過發達者。注",
      "交友": "1.廣交際、善攀緣、八面玲瓏、長袖善舞。2.圓融、親和，老少鹹宜、群眾魅力。很能融入別人的生活圈。心胸寬廣。3.也擅長攀親援故。器量大。貴人旺。善轉圜。4.善借力使力，順水人情多。5.鄉願討好。6.喜歡奉承人家。最容易處理人際事務。7.適合政治〈太陽星〉、演藝〈貪狼、廉貞星〉、公關、業務工作〈廣受歡迎〉。8.",
      "事業": "1.際遇好、機會多、容易攀緣、得人和。好口碑、好信譽。可以創造風潮。2.有福，運氣好，利潤佳、訂單容易入手。也容易心想事成。善汲營。3.出外好賺錢。容易逢貴人，最能大事化小、遇難呈祥。4.四方有財，適合公關、業務、廣告、貿易往來、運輸業。也可從事於休閒、旅遊、娛樂，流行時尚等工作。5.特種營業〈偏財星〉。",
      "命宮": "1.際遇好、機會多、容易攀緣、受禮遇。善用社會資源，常心想常事成。2.聰明、才華。修行人的根器高（宗教星)，會權尤佳。器量大。興趣廣。3.宜公關工作或業務發展。也容易獲機遇、受拔擢。攀緣如意。4.出外發達、八方有財，也容易多旅遊、驛馬動。5.福報好、貴人旺、遇難呈祥。6.老運好、不會寂寞。擅長自我調試。7.喜歡人家的奉承，防逍遙流連。8.逢偏財星，中獎、意外財，會權尤佳。",
      "疾厄": "1.多旅行、好冶遊。性逍遙、閒情逸致。享受現成。心想事成。2.喜歡新鮮感受、流漣美好情境。3.容易放鬆，忘志、少了積極責任。4.福厚少災、好事臨身。一生少久病折磨，有病也容易得貴人，遇難呈祥。5.喜歡人家奉承、侍候。但也擅長自我調試、隨遇而安。6.修行人放下、自在〈宗教星〉。7.逢偏財星會田宅、兄弟、財帛之權，發財甚速。",
      "財帛": "1.際遇〈機會〉好、容易攀緣、四方來財山窮水盡也即現柳暗花明。2.財源廣進、賺錢容易、賺錢機會多、出外好賺錢。善運用社會資源、廣告宣傳、領先潮流，很能開創財路與收入。3.天降橫福〈財、壽〉、大事化小、遇難呈祥（祿照福德）。器量大。4.適合分紅薪水、業務工作。格局好，應該創業做生意。善用宣傳廣告，可鴻福化財來。只要盡人事，財神爺不會虧待你。5.適合旅遊、休閒產業，流行時尚。也可從事于精神、心靈、宗教、才華、文化等工作（遷移-福德的事業，也是精神訴求宮）。也適合進出口貿易。6.配偶收入好（遷移-夫妻的財帛宮）。",
      "福德": "1.歡樂、逍遙、開朗、溫和、好脾氣。無所謂、少計較、容易隨遇而安。凡事往好處想。容易自我調試。2.喜歡新鮮的事、物，喜歡外面溜搭、喜歡熱鬧，怕寂寞。隨緣好相處。3.還防太過感性的迷情惑境、移情忘志。少了積極性、責任心耽誤了前程。4.重蹈覆轍、愛做夢、耽于逸樂。5.有福，遇難呈祥、大事化小。壽相、老運好。6.逢偏財星，容易中獎、意外財。橫發。7.善念與修行的放下、自在〈宗教星〉。（注"
    },
    "權": {
      "子女": "1.身教栽培子女〈遷移為形象位〉。但防喜歡高姿態、出口訓誡。2.善用社會資源成就子女。發達於子孫象。3.望子成龍、欲子女出人頭地。",
      "夫妻": "1.際遇強，容易開創獲致地位、成就。2.出外較有發展的機會〈權照事業〉。3.逢偏財星，中獎、意外財。橫發。4.容易因夫（妻）而貴。",
      "父母": "1.學習快、反應佳，容易見多識廣。2.適宜在職進修、邊做邊學。學習機緣好。也容易現學現賣、學位所用。3.考運強、手氣好。4.善攀緣造勢，上層社會關係好。5.格局差，防趨炎附勢、倚勢傲慢、為虎作倀。愛說占上風話、虛榮愛現（會祿）。6.",
      "兄弟": "1.際遇佳，容易得緣造勢、積極、活耀，社會地位自高。2.運作社會資源，容易創造局面。3.利於升遷、創業。也利於競爭、競選〈會交友祿〉，拓展、開創。4.可以出人頭地，富貴可期〈偏財星會祿尤佳〉。5.健康愉悅、吉祥如意。",
      "田宅": "1.活力、開創、頗得助緣，容易發富。也容易是田僑仔（逢偏財星尤顯）。2.可以外鄉發達、衣錦還鄉。也能外地置產。3.天降橫福發財富〈偏財星會祿尤佳〉。4.黃金店面、熱鬧地段〈偏財星〉。5.利於創業從商。6.祖上或有公門為官者。",
      "交友": "1.格局好，社交能力好，善長人脈資源的運作。2.活躍、主動，容易出風頭，喜歡凸顯自己。格局差，炫耀、高姿態、占上風，容易招惹事非。但防成過眼雲煙的虛榮、傲慢。3.可從事創意、開發，專業、引領風騷、領導流行等工作〈產品〉。4.容易趨炎附勢、結交權貴。5.",
      "事業": "1.社會地位好，容易攀緣得勢、獨擋大局。2.應變、能力，最利於升遷、創業。擁專業、專技、專利，可以精藝創局、獨到營造。3.容易攀緣創造局勢。行動力強。創造風潮。4.善用社會資源，水漲船自高。四方有財。福厚，也容易位居要津。5.社會地位愈高，事業愈順。6.配偶收入高（遷移-夫妻的財帛）。",
      "命宮": "1.社會地位好，也容易汲營得勢、創造機會、獨當大局（會交友祿尤佳）。2.智慧、膽識、積極、略謀、領導統馭。行動力強。3.際遇佳、能力強，出外成就好，宜向外拓展。4.善用社會資源，利於升遷、創業。5.但防趨炎附勢、傲骨、自大。5.擁專技、專業尤佳，會交友祿，常傲視群倫。6.逢偏財星，中獎、意外財，會祿尤佳。",
      "疾厄": "1.身體健壯、活力、抵抗力強，好動、抗壓、蠻皮、膽大鎮定。2.個性粗線條、乾脆、憨膽、大方、蠻勁。也容易特立獨行。3.工作場大。適合生產行業（偏財星會祿尤佳）。",
      "財帛": "1.能力強、善攀緣，向外可求多財。2.格局好，容易掌控時機，創造利潤。3.擁專技、專業可以精藝，收入更好。4.善用社會資源，利於升遷、創業，可以位居要津。善廣告、創風潮，鴻福化財。5.容易高職、高薪、高收入。6.配偶收入高。7.格局好，汲營得勢、借力使力、行動力強。格局差，防虛榮炫耀、眼高手低。（社會上常見局面差者反而大張旗鼓、壯其門面，藉以利其周轉使力。）",
      "福德": "1.藝高膽大、聰明機靈，容易自信、傲骨，自恃甚高。還防只是浪得虛名，看高不看低。不自量力。格局佳，主動積極，行動力強。2.防奢華、浪費。3.逢偏財星，中獎、意外財。橫發。4.修行者，根器高、勇猛精進〈宗教星〉。"
    }
  }
};



const ZIWEI_DATA_ZIHUA = {
  "子女": {
    "忌": {
      "子女": "1.少用心於子女的教養或不得要領、沒原則的教導作為。2.小孩馬耳東風或子女對我產生離心力。3.子息緣〈福〉不厚，養兒未必能防老，還防晚境自珍〈縱有若無〉。4.合夥難成事或合夥緣不長久。5.逢桃花星，饑不擇食的濫桃花，也防性能力早衰、過度沒原則的房事。"
    },
    "科": {
      "子女": "1.小孩文質不會變壞，但防優柔寡斷。"
    },
    "祿": {
      "子女": "1.格局佳，子女可以自給自足。2.小孩緣雖好，但防對小孩教養沒盡責，少耐心。善哄小孩。2.逢桃花星，防好嘴鬥、沒原則的濫桃花、半路情、一夜情、風花雪月情。"
    },
    "權": {
      "子女": "1.2.3.只適合短期合作，不適合長期合夥。"
    }
  },
  "夫妻": {
    "忌": {
      "夫妻": "1.2.還防貌合神離、感情生了離心力。3.不宜賭、投機。還防少小災病。4.宜用心經營婚姻。"
    },
    "科": {
      "夫妻": "1.配偶秀氣，防優柔寡斷。2.3.婚緣常由己結識。也容易舊情搭上線。"
    },
    "祿": {
      "夫妻": "1.看似異性緣旺，但防緣淺或情不恒常。2.沒原則、好嘴鬥的不正常感情觀，容易一夜情、春花又秋月〈桃花星〉。濫情。3.看似甜蜜，還防貌合神離。經不起考驗（用心不足）。4.配偶自給自足、善自求多福。5.容易感情遭劫〈他宮同星曜忌入〉，或我意亂情迷，行為失則〈我宮同星曜忌入〉，徒生怨、恨。"
    },
    "權": {
      "夫妻": "1.配偶較自恃、任性、自以為是，但未必有大作為。2."
    }
  },
  "父母": {
    "忌": {
      "父母": "1.格局差，不喜唸書、不虛心、不受教。2.討厭繁文縟節、不愛僞文多禮。不重形象外表、快意偏辭。或生性靦腆。3.少了氣質、差了形象。4.命格佳，雖率直不拘小節、不喜文飾，究竟是容易失禮、不討好。"
    },
    "科": {
      "父母": "1.清秀、氣質。與長輩關係尚好。"
    },
    "祿": {
      "父母": "1.2.溫和愉悅、討好歡喜，但防只是有口無心、阿諛言好、會奉承的偽君子。容易討好卻輕慢不莊嚴。3.但防讀書、學習聰明有餘而用心不足，未盡全力、不求甚解。"
    },
    "權": {
      "父母": "1.個性容易膨脹、裝腔、傲慢、尖銳。2.3.學習快，但防粗枝大葉、少了甚解。"
    }
  },
  "兄弟": {
    "忌": {
      "兄弟": "1.手足情淡各顧自，或無情少助力。兄弟若有似無。2.我容易漏財、暗耗，不容易繼續、還防收入不穩定。亟需加強財務管理。3.體質下降，需持續運動、養生。4.宜上班族的安定。"
    },
    "科": {
      "兄弟": "1.兄弟文質、優柔寡斷。2.宜理財計畫。"
    },
    "祿": {
      "兄弟": "1.手足看似有情，但防兄弟隨性失然諾。兄弟也不夠團結。但防兄弟的依賴性。2.可以經濟自足，但少有理財計畫。3.最宜現金生意的日日見財。或銷售、業務、服務業等短期見利的工作，但宜認真於管理。4.逢他宮忌入，則我庫遭劫〈同星曜祿忌成雙忌〉。"
    },
    "權": {
      "兄弟": "1.兄弟膨脹、自傲、強出頭。兄弟各自為政、不團結、意見多。2.經濟雖強但沒有縝密理財計畫，防無意義的支出、浪費。3.適合現金生意或銷售、業務、技術、專業等服務業，不壓本、回收快的工作。4.看似積極，但防少了明確的目標和方向。"
    }
  },
  "田宅": {
    "忌": {
      "田宅": "1.家庭空洞化。格局差，防人生多起伏、難守成。也防財路不安定。2.最忌採光不足、雜物堆積、髒亂窒礙，令家運惡性循環。3.防宗疏親離。4.容易多搬家、脫產。在家時間少或在家待不住。家庭少了溫馨的感覺。5.房產緣不足，不動產少登記自己名下。6.宜上班族的收入安定。7.少了天倫樂，晚景自珍重。（凡田宅三方的自化忌，防家庭中的親和力不足。）"
    },
    "科": {
      "田宅": "1.書香、樸實、名聲自揚。"
    },
    "祿": {
      "田宅": "1.少有用心于家務與理財。家庭責任心不足。防家庭成員不夠團價、積極及依賴性。少了計畫的持家。2.家庭容易表像好看而裡子凝聚力不足。3.家庭宜經營現金生意可日日見財，容易自給自足。4.逢他宮忌入，則我庫遭劫〈同星曜祿忌成雙忌〉。"
    },
    "權": {
      "田宅": "1.家宅看似興旺，防各自為政、意見多。2.但防成員多強出頭而不團結。3.統籌規劃及強制性理財可以令家庭興旺。"
    }
  },
  "交友": {
    "忌": {
      "交友": "1.交友不長久、防友情經不起考驗、交友少情、無義。或我待人不夠誠懇用心。2.我之于朋友的態度存不喜迎逢、至情真性乎？但防用情少智而後終心灰意冷。3.終究知己難得或知心凋零。4.或有機身孤僻，敷衍應事、人員不厚。5.閒事少理，防公親變事主。也防知己不得力。〈注 凡事不能只怨他人，也應內省於己。事多出於相對的兩個巴掌才能打得響。交友之失，也必應自省於人際的交遊態度。〉"
    },
    "科": {
      "交友": "1.雖非思情久悠悠，尚屬君子之交象。"
    },
    "祿": {
      "交友": "1.容易少理性的臭氣相投。2.看似廣結善緣，但防多交信口開河、附和曲直、阿諛讚歎的朋友。3.看似和諧，防少存至性，盡是虛歡。格局佳，人緣廣而人際和諧。4.相識滿天下、知心能幾人？"
    },
    "權": {
      "交友": "1.交友多愛現、膨風。物以類聚，多非真情至情。防虛張沸騰。2.3.格局佳，多熱心主動的朋友。"
    }
  },
  "事業": {
    "忌": {
      "事業": "1.上班領薪最穩妥。2.做生意宜速戰速決，無囤貨、不壓本、通路快的作法。現金買賣業。3.適合顧問、仲介、技術等服務業。或雜貨、日用品、消耗品等生活所需用品〈忌出消散，最宜消耗品的重複需求的產品〉。4.非常不適合費時經營的生產事業。5.逢他宮飛祿以入〈同星曜祿忌成雙祿〉，得了便宜還賣乖，容易生仇結怨。〈注 凡命、財帛、事業三方見祿者多偏適於業務、銷售獲利。見權者則較適於專業的開發、領導。〉〈注 凡同一星曜的自化祿逢他宮忌入，或自化忌逢他宮祿入，皆屬不合人性常態下的祿忌成雙祿或雙忌。得失之間最容易產生糾紛、結怨、打架等情事。〉"
    },
    "科": {
      "事業": "1.可以加強精緻于文宣、包裝。2.宜上班領薪。"
    },
    "祿": {
      "事業": "1.不應投資回收慢的生產行業，也不宜重本、耗時間、單一產品、單向財路的投資〈譬如承包工程〉。2.宜短期回收、重複需求的消耗品或符合潮流創新下產品推陳出新的銷售。以及開發相關性的附屬產品，增廣財路。3.最宜多點子、時尚創意的產品，也可以會員直銷（自化祿-自我膨脹）或速戰速決、機動化、的賺錢方式。4.逢他宮飛忌以入〈同星曜祿忌成雙忌〉，防倒貼於人，傻呼呼被人利用。5.利於買賣業。"
    },
    "權": {
      "事業": "1.看似積極，但防虎頭蛇尾或不得要領。2.當老闆較不長久穩妥。3.做生意以領先潮流、追求時尚、創新產品的作法為佳。生意手法也應以機動性、多元化、且戰且走為佳。4.適合於專技、專業的工作。不適合投資大、回收慢的生產事業。5.利於買賣業。"
    }
  },
  "命宮": {
    "忌": {
      "命宮": "1.不記恨、不堅持、忘性、但防做人做事少原則。不長智慧。出爾反爾。城府不深、少了冷靜。也容易見異思遷的自我否定。2.事情過就算了、不能記取教訓。3.但防少了自主定見而看似自在的無所謂、沒關係，實則少了自我的意志與耐性的不足，終致不了了之。4.逢他宮飛祿以入〈同星曜祿忌成雙祿〉，是人倒貼於我、得了便宜還賣乖，最容易生仇結怨。〈注 凡所有自化皆屬輕漫與消散，代表處世少了擇善固執之理性與原則，容易沒有大局觀。〉"
    },
    "科": {
      "命宮": "1.文質、秀氣、乖巧。2.但防優柔、容易做作。"
    },
    "祿": {
      "命宮": "（此處資料來源未提供命宮自化祿的完整論述，請參考「凡所有自化皆屬輕漫與消散」的概念。）"
    },
    "權": {
      "命宮": "1.個性雖也自信，防少了定見、不自覺的愛膨風、烏賊吐墨。2.看似積極，但防不堅持、雷大雨小、虎頭蛇尾、自以為是、多反覆決策。防當下快意衝動而失遠慮。3."
    }
  },
  "疾厄": {
    "忌": {
      "疾厄": "1.容易過勞或少意志的空忙勞。2.少了方向感。3.格局差，容易發病則藥石罔效或很快死亡、也容易殘傷〈缺陷或器官摘除，疾厄忌出〉4.田宅三方多得祿、權者，格局高則興家旺宅；格局差也可以自家開店營利、安家活口。田宅三方而多得忌者，只宜保守而為或上班安穩。不得輕易大筆投資。〉"
    },
    "科": {
      "疾厄": "1.文質有餘，但防優柔、矯飾。"
    },
    "祿": {
      "疾厄": "1.安樂、慵懶、享受生活、隨遇而安、沒耐性半途而廢，小心發胖。2.雖好相處，但防漫不經心、依賴、原則意志不足，容易被牽著鼻子走（疾厄-交友的福德）。3.欠積極、溫敦緩散，機會容易從手邊溜過。"
    },
    "權": {
      "疾厄": "1.體型結實、多動少靜。2.個性粗線條、不矯飾。憨膽、衝動。3.最容易撞、跌瘀、內傷，運動傷害。4.積極有餘，但防少了方向的莽撞。"
    }
  },
  "財帛": {
    "忌": {
      "財帛": "1.現金緣差。口袋經常沒法多帶錢，多了總是有事將錢花掉。或錢老是花在非刀口上。2.此象最好別做生意，否則不是生意差、利潤微薄、風險損失就是多賺也多外務花用。3.適合上班領固定薪水，或從事技術、仲介、顧問、會計、代書等服務業（少成本投資）。4.逢他宮飛祿以入〈同星曜祿忌成雙祿〉，得了便宜還賣乖，最容易生仇結怨。〈注 財帛宮自化，代表金錢管理有問題或財源、財務狀況上的不易掌控。〉"
    },
    "科": {
      "財帛": "1.宜小生意的細水長流或上班族。2."
    },
    "祿": {
      "財帛": "1.現金容易來，當然也因手頭方便又沒有理財概念而多花用，少有金錢規劃。2.很適合現金生意的日日見財，但須嚴格的自我金錢管理，有錢隨時生意上的迴圈投資或養成儲蓄積累的習慣。很利於買賣業。3.口袋裡千萬別放太多錢，很容易浪費而多花用。4.逢他宮飛忌以入〈同星曜祿忌成雙忌〉，則我財遭劫、倒貼於人，容易被人賣了還幫人數鈔票。"
    },
    "權": {
      "財帛": "1.金錢容易整筆來，但也容易大筆花用。2.宜現金生意切貨、脫手的迴圈生財，最好走潮流、時尚等領先市場的產品銷售。俗話說的時機財，好也不會太長久。所以適合不斷推陳出新的企劃與產品變化。3.宜上班領薪資，也適合買賣業。4.看似積極卻沒有長遠的計畫與管理。也須加強理財及養成隨時儲蓄的習慣。"
    }
  },
  "福德": {
    "忌": {
      "福德": "1.心境不定，不能隨遇而安。防脾氣快直而少辯是非，看心情作決策，不冷靜，自亂陣腳。2.3.逢他宮飛祿以入，得了便宜還賣乖〈同星曜祿忌成雙祿〉，徒生仇怨。4.福不足，折福、不惜福，防災病。格局差，防傷殘及器官摘除。5.看似自在而少了執性、沒有原則，決非修行人的妙有真空。6.不宜賭、投機。別指望天上會掉禮物。7.老運還自珍重。"
    },
    "科": {
      "福德": "1.雖恬淡自適，但防優柔。"
    },
    "祿": {
      "福德": "1.樂天少覺，隨緣忘志、感性瀾漫。漫不經心、好情緒。愛做夢、自得其樂、隨遇而安、好商量。2.少了憂患意識，沒有生涯規劃。不積極、沒衝勁。3.逢他宮飛忌以入〈同星曜祿忌成雙忌〉，倒貼於人，被賣了還幫著數鈔票。4.宜穩斂自持，冷眼內觀。不得依賴，自我激勵。"
    },
    "權": {
      "福德": "1.〈格局差，搞不清楚局面〉。2.看似積極，但防五分鐘熱度或少了縝密計畫。容易衝動行事。3."
    }
  },
  "遷移": {
    "忌": {
      "遷移": "1.臨急容易成了無頭蒼蠅。幼稚。2.3.或有不愛交遊、不喜逢迎，防遺世渺俗、親疏朋離。應對人事少圓滿。4.格局差，防孤僻冷漠的不好相處、或少智慧的不愛用心，不辨是非、不冷靜。不能隨遇而安、亂無章法的行為模式。5.不宜賭、投機。別指望天上掉禮物。6.宜沉思深斂，觀察學習。增長見聞、汲取教訓。7.老運自珍重。"
    },
    "科": {
      "遷移": "1.斯文、防矯柔作飾。"
    },
    "祿": {
      "遷移": "1.喜新嘗鮮、漫自歡欣。容易隨緣生境、渾然忘我。逍遙。耽于逸樂。少原則。2.防外緣雖好而情不恒常，少了用心應對。情緒常好而意志力差。3.易受人左右，還防被人利用〈他宮同星曜忌入祿忌成雙忌〉，產生怨、恨。"
    },
    "權": {
      "遷移": "1.虛榮愛面子〈會祿尤顯〉。紙老虎。2.少了原則、穩斂不足。容易衝動行事。3.但防五分鐘熱度、表面功夫。或事過境遷的小聰明。也防趨炎附勢、為虎作倀。"
    }
  }
};



//生年四化的對應表
const ZIWEI_DATA_SIHUA_N = {
  "子女": {
    "忌": "1. 小孩「固執」，不好溝通。2. 欠子債，防小孩沒出息、不聽話或乖違、欠安。3. 對子女教養「不得要領」，疼子太過。4. 容易在家呆不住。5. 驛馬、搬家、退財、去產，少理財計畫，防人生多起伏、難守成、收入不穩定。6. 不動產少登記自己名下。7. 防晚景差，宜修心養性、積德。",
    "科": "1. 小孩文質、秀氣。2. 小孩較乖巧。",
    "祿": "1. 容易得子息、多生兒子。但防寵小孩。2. 有子福，小孩比較不會學壞，也不容易出敗家子。3. 親戚多往來。4. 比較多合夥機會，合夥容易賺錢。5. 驛馬。離家機會多或喜歡往外跑。6. 容易遇難呈祥、晚景好，有依靠，好情緒。7. 宜向外求財。",
    "權": "1. 格局好，子女主見強，容易有成就。2. 格局差，小孩個性強而不好教，管教需費神。3. 子息緣旺。4. 合夥容易有成。5. 宜向外求財。6. 晚景好。生命力較強韌。"
  },
  "夫妻": {
    "忌": "1. 配偶執著，不易溝通，婚姻宜忍。或病災急難之累。2. 我執著於情，防遇人不淑，晚婚為宜。3. 欠婚姻債，防諸多波折、乖違。4. 不利於桃花、婚外情，慎防感情債。5. 勿賭、投機，福分財不厚。6. 婚後適合單純的小家庭。7. 欠婚姻債，縱令離婚也必經拖磨煩累。8. 適合上班安穩或現金生意。",
    "科": "1. 配偶文質、秀氣。2. 或配偶家世較單純。3. 容易藕斷絲連的感情。",
    "祿": "1. 異性緣佳、婚姻得福。2. 容易感情早動、早婚。3. 或我多情，容易桃花、齊人之福。4. 婚後較多如意。5. 一生工作運較如意。6. 少小運平妥無礙。7. 一生花用的金錢順遂。8. 配偶通情達理好相處好商量。9. 逢偏財星，投機、中獎。",
    "權": "1. 配偶主見性強，但防容易起爭執。2. 我工作運強。3. 少小運平妥無礙。4. 逢偏財星，投機、中獎。5. 一生金錢多順遂。6. 一生工作運較如意。"
  },
  "父母": {
    "忌": "1. 長輩緣差。狹隘的預設立場。小器量。2. 格局不佳，防忘性、沒耐性、意志力不堅，人生變動多、難守成。3. 防代溝。4. 表情嚴肅、個性刻板、不婉轉、實話直說。容易面噁心善。吃虧、不討好。5. 格局差，防不學無術、沒氣質、不知禮儀。容易激動。6. 讀書、考試需認真，很難投機取巧。7. 格局好，孝順、愛唸書。欠父母債。8. 需盡孝養之責、或幫父母分憂解勞。9. 小心與人金錢往來被倒賬。10. 容易房貸，也防戶籍、稅單、證件、契約、罰單、支票等文書問題。11. 外（夫）家生活辛勞。12. 婚後適合小家庭。",
    "科": "1. 謙和、有氣質。2. 談吐斯文、平和。",
    "祿": "1. 和顏悅色、恭敬有禮。善表達、開明識大體、討好、聰敏、好脾氣。2. 長輩緣好、父母好溝通。3. 利於唸書、考試、公職。證照取得。4. 獲父母之蔭，也容易上司拔擢。5. 外〈夫〉家家境好。6. 子女事業順利。7. 學習與安好，容易見多識廣器量大。8. 加科，謙恭而得形象佳、好名聲。9. 婚後可與長輩同住。",
    "權": "1. 加忌則容易草莽、魯直性格。2. 格局好，記性佳。利於唸書、考試、公職。證照取得。3. 宜多讀聖賢書，則談吐有物。仗義執言。利於提升社會立足點。4. 子女也容易事業有成。5. 外（夫）家家境優。6. 加福德忌，防容易激動、易怒、穢言、無禮。 "
  },
  "兄弟": {
    "忌": "1. 多為上班族或現金小生意者。2. 守成、安定、顧家、內斂。3. 事多躬親、老闆兼夥計。4. 朋友不廣交，喜歡內斂、清靜。5. 女命容易是職業婦女。6. 命格佳，積沙成塔。7. 容易是長子，為兄弟付出。8. 兄弟較執著不好溝通或手足情較薄、成就不高。母個性也較煩惱多憂。",
    "科": "1. 兄弟文質。2. 宜上班安穩。3. 養生、健檢。",
    "禄": "1. 兄弟平順如意、兄弟是我福。2. 兄弟好相處，手足情深。易兄弟多餘姐妹。3. 一生事業、金錢多順少逆，利於升遷、創業。4. 人氣旺，不寂寞，身邊不乏朋友。5. 體質少病，中氣足。6. 母緣佳。7. 主臥房大、畫眉樂。",
    "權": "1. 兄弟容易有主見，有成就。2. 容易上有兄長。3. 我也容易事業、金錢有成。4. 領導能力。5. 體質強。6. 積極、開創，利於升遷、創業。7. 母能力強、主臥房大。"
  },
  "田宅": {
    "忌": "1. 生活的壓力或責任心重，容易生錢財欲望。第一次置產也宜（容易）買二手屋。格局差，容易出身較差或家庭債。2. 房子小或舊，或環境不佳。應予改善，否則運氣容易惡性循環。3. 守成、儉約、顧家、內斂、勤快，辛苦起家。也能守祖業。勿投機。4. 宜上班族安定，或現金生意。5. 格局佳，積沙成塔、小生意賺大錢。6. 顧家不免存私心，較少人事交際往來。7. 容易是長子。也可能子息緣弱、欠家庭債。",
    "科": "1. 房子不大，但樸實有餘。2. 家中書香氣息，少有爭嚷。3. 物質生活恬淡。",
    "祿": "1. 家庭福厚、家庭和樂、與家人好相處。物質生活優渥。2. 得祖蔭、承祖業、祖地可發跡。3. 逢偏財星，容易發富。4. 住宅環境好或房子大、房子舒適、房子值錢、地段好、新房子。不動產容易升值。5. 子息旺，多生兒子。子孫也較有出息。6. 宗門興旺、祖上有德。宗親多往來。7. 可自家開店營利。也適合店家合一。8. 不動產緣好，容易早置產或得助置產。9. 女命旺夫益子。",
    "權": "1. 家世好或家族旺。2. 或本身容易開創財富。也容易創業。3. 家庭富積極、活力或家教嚴謹。4. 房子大、不動產值錢或地段好。5. 也可以自家開店營利或出租。6. 逢偏財星，容易發富。也可從事不動產行業。"
  },
  "交友": {
    "忌": "1. 為人惜情、重義、仗義疏財、重然諾。2. 散財、少蓄、理財不得要領，不容易存錢。3. 配偶勞碌不得閒，但防婚姻少趣。4. 考運較差。也不利於競爭、升遷。5. 格局差，還防人生多起伏、難守成、收入不穩定，宜上班安定。6. 兄弟憨厚、耿直。",
    "科": "1. 所交朋友多謙和。君子之交象。2. 友情綿長、君子悠悠情。3. 少不良嗜好的朋友。",
    "祿": "1. 對人和善、予人愉悅，人緣好。多情、好客。2. 獲交友福，容易得到人際的幫助。多益友。3. 配偶好相處。4. 配偶豐腴、容易發胖。5. 考運好，利於競爭。6. 經濟好，方便而多支出。7. 兄弟親和、開朗、外緣好，也多如意。8. 格局差防虛有其表。",
    "權": "1. 容易交上能力好、有成就的朋友。2. 兄弟有地位、成就。3. 配偶身體硬朗。4. 長輩事業有成。5. 考運強。6. 格局好，交友成就我。格局差，容易被牽著鼻子走。7. 格局差防虛有其表。"
  },
  "事業": {
    "忌": "1. 工作忙碌或壓力重、工作時間長。2. 專注、事易躬親。老闆兼夥計。3. 上班安穩或現金生意。4. 女命也是職業婦女。5. 配偶耿直、憨厚，不善甜言蜜語。格局差，但防婚姻少情趣，甚或產生離心力的貌合神離。6. 爛婚外情〈桃花星〉，格局差，桃花容易破壞了婚姻。7. 小時候宜重拜父母，當人養、契、義子。8. 格局差則煩心、辛苦，格局好也是多勞之得。",
    "科": "1. 平穩有餘、但防魄力不足。2. 宜上班安穩。適合文職或企劃工作。",
    "祿": "1. 運氣好，工作容易入手、工作機會多，也容易心想事成。2. 接單機會也較穩當。職場多如意。3. 配偶開朗、外緣好。4. 小孩健康好養。",
    "權": "1. 積極、應變、活力，能力好。2. 善汲營，收入好。3. 適合開發、拓展、領導工作，利於升遷、也可以創業。4. 擁專業、專技尤佳。5. 配偶能力強，能夠獨當一面。6. 小孩身體健康。"
  },
  "命宮": {
    "忌": "1. 執著、固執、偏執狹隘，難溝通。沖遷移。2. 容易記恨、煩惱、生氣；小心眼。3. 貪、嗔、癡，防入死胡同而不自知。4. 具業力，人生多了點煩心勞苦。5. 人緣較差。防風度、氣量不夠大。6. 忌入命為個性收斂於內，不能敞開心胸。遇事情容易自我多思慮、煩擾；格局差者，甚或焦躁、自閉。",
    "科": "1. 長相斯文、秀氣。2. 個性較為文質、溫文，少戾氣。",
    "祿": "1. 主福。一生少憂，衣食無虞。處世較平和。2. 通情達理，隨緣不固執。多好心情、好情緒，令人愉悅。也較隨遇而安。3. 不記恨，好相處。人緣好。4. 主婚姻、家庭乃至與父母、子女間的容易相處融洽。",
    "權": "1. 主觀、主見、自我、自信。2. 容易不虛心、防自以為是、自恃甚高。3. 性剛、任性。4. 格局好，掌權、能幹、積極，可以開創。5. 加忌則剛愎自用。"
  },
  "疾厄": {
    "忌": "1. 勞碌、不得閒。格局差，多勞煩。2. 盡本分。守成。內斂，可以吃苦。3. 加權，格外勞碌。4. 兼職、加班。女命容易是職業婦女。5. 不容易發胖，胖則防病。6. 命格差，防宿疾久病，需持續的運動強身。7. 最好退而不休，閑則似病。8. 自我意識較濃，與人相處不夠隨緣、少顧及別人的感受。",
    "科": "1. 容易病得良醫、良藥，身體的貴人好。2. 少戾氣、舉止斯文。",
    "祿": "1. 懶散、少流汗，小心發胖。2. 容易隨遇而安，不夠積極而耽誤正事。3. 物質生活較優渥、享受。生活空間也較舒適。4. 家運好，少操心。好情緒。5. 少久病糾纏的折磨。6. 工作環境佳。7. 與媳婦好相處。8. 本人亦好脾氣、好相處、好商量。",
    "權": "1. 身體結實、硬朗。2. 抵抗力較強，小病少。3. 比較活力、多動。4. 個性較乾脆、直線條。5. 但防跌撞傷、運動傷害。6. 加忌則活動量大、格外勞碌。"
  },
  "財帛": {
    "忌": "1. 適合固定薪資或辛苦之得的現金生意。2. 賺錢辛苦、賺辛苦錢。3. 格局好，勞碌、操心、卻愛賺錢。4. 容易事多躬親。5. 女命易為職業婦女。6. 格局佳，小生意賺大錢、積沙成塔。",
    "科": "1. 小額周轉容易。2. 涓涓滴流，不無小補。3. 適合上班族。",
    "祿": "1. 與錢有緣、財路好。2. 一生衣食無憂。3. 賺錢機會多或賺錢容易、收入好。4. 婚姻相處較好。5. 現金緣好，適合銷售及業務工作，也可以從事現金生意。6. 宜分紅薪水。不宜固定薪資。7. 祿喜權會，則機遇會更劄實、拓展的空間更大。",
    "權": "1. 有見地、積極，能力好。2. 善汲營，收入好。3. 適合業務的開發、拓展、領導工作。利於升遷，也可以創業。4. 不宜固定薪資，適合分紅薪水。5. 宜專業、專技，能高薪、高職。6. 權喜祿會，則機遇會更劄實、拓展的空間更大。"
  },
  "福德": {
    "忌": "1. 少了金錢概念。2. 格局差，防執一棄萬而不能顧全大局，或玩物喪志、沉迷嗜好而人生偏廢、荒政。3. 適合專業性的研發、設計等興趣、專精、鑽研的工作。4. 很適合仲介、技術、會計、顧問、代書等服務業。5. 少投機，遠睹、毒、酒、色等不良嗜好，以免迷情妄欲，也防著於愛恨、偏執喜樂自誤前程。6. 命格差，業力較重，容易杞人憂天、憂患太過。容易計較、小器量。7. 命格不佳，命運容易乖違、顛沛等困頓。運限差時，容易出現業力病、破財。",
    "科": "1. 恬淡安逸、修心養性、平實無華。2. 個性平和、不疾不徐。3. 內涵、品味、清靜。",
    "祿": "1. 樂觀、樂天知足、少計較。享受現成。容易自在、隨遇而安。2. 興趣廣，但防頭熱尾涼、博學而少專精，說多而做少，不夠專注、堅持。3. 依賴。4. 福報好、安逸，常不求自得、心想事成，也能遇難呈祥或禍不臨身。5. 壽相、晚景優。好情緒。器量大。6. 少惡疾、久病之折磨。7. 適合興趣、才華、心靈、藝術、精神、文化等工作，也可從事休閒、旅遊事業。8. 逢偏財星，中獎、意外財，不勞而獲。",
    "權": "1. 積極、自信、企圖、欲望。2. 敢賺敢花、容易重物質生活。3. 格局好，常心想事成。格局差，眼高手低。4. 會祿，虛榮好勝。5. 擁專業、專技常大筆收入。6. 做生意走高格調、高價位、大手筆的作法。7. 逢偏財星，投機、中獎。"
  },
  "遷移": {
    "忌": "1. 耿直、憨厚、內向、靦腆、拙樸、膽怯、忘性、嚴肅、刻板、保守、少心機，應變能力差、臨急容易慌亂。2. 無私、正直。3. 不善察顏觀色，容易實話實說、直來直往、城府淺而吃虧、不討好。4. 不善裝扮、不重外表。5. 拙驛馬，容易出外，卻又不容易早成就。6. 宜閒事少理，獨善己身。少能掌控大局。7. 不得賭、投機。人算不如天算。8. 不發少年人，大器也晚成。年輕宜上班安穩。9. 格局差，防眼界狹隘、固步自封。孤獨少趣。10. 女命多安靜守分。11. 格局差，防意外、業力病。12. 修行 一身清靜的阿羅漢果位。",
    "科": "1. 高雅、文質、秀氣、形象好。",
    "祿": "1. 圓融、親和、機伶、幽默、開朗，外緣好、識大體、受歡迎。2. 聰敏、善察言觀色，容易攀緣。機會多、際遇佳，事多順遂。3. 容易逢凶化吉、遇難呈祥。4. 驛馬，出外緣好、出外機會多，宜向外求財。5. 適合公關、業務工作。宜分紅薪水。6. 晚運佳、壽相。7. 天份、智慧、善緣、根器。眾生緣好。8. 格局差，防太過鄉願討好而少是非分明。9. 逢偏財星，投機、中獎。10. 會科則形象特佳，容易獲聲名。",
    "權": "1. 積極、活力、開創、自信。2. 果斷、膽識、應變、聰敏、能力、謀略。3. 反應敏捷、記性佳，容易見多識廣、獲成就。4. 適合領導、開創工作。可以獨當一面。5. 適合專業、專技，利於升遷、創業。6. 可以高薪或分紅薪水。7. 可獲高職位、高社會地位。8. 格局差，尖銳、自負、不謙虛、霸氣、結怨。不納忠言。9. 逢偏財星，投機、中獎。"
  }
};


//各星曜的對應表
const ZIWEI_DATA_MAIN_STARS = {
  // 紫微系（紫微、天機、太陽、武曲、天同、廉貞）
  "紫微": {
    "代表人物": "周文王的長子〔伯邑考〕",
    "五行": "己土",
    "特質": [
      "尊貴高尚，是紫微系之首，位居北斗，有中天帝座之稱",
      "代表珍奇古董、珠寶鑽石、滿天錶、進口高級轎車、高級傢俱、高樓大廈等高貴物品",
      "主精密、高貴、高價的物品，如電腦",
      "紫微帝座有制化解厄、消災延壽的作用，故為壽（但實質作用不大，因沒有化祿）",
      "飛斗數的實務運用上，極少用到紫微的論述"
    ],
    "身體部位_化忌": "紫微沒有化忌，所以不論（論疾病時才論身體部位）",
    "四化": {
      "化祿": "無",
      "化權": "壬紫微化權",
      "化科": "乙紫微化科",
      "化忌": "無"
    },
    "化象註解": [
      "紫微化權代表能力，紫微不會化祿，故權不會有任何宮位化祿來會，因此常『有志難伸』，缺乏發揮的舞台或機會",
      "生年或命宮『紫微化科』坐父母、遷移，此人氣質必定高尚優雅，給人清新脫俗的感覺",
      "生年或命宮『紫微化權』坐遷移，此人能力好，觀察力敏銳，做事果斷，有不怒而威的儒將之感；女命則較為豪氣",
      "命宮『紫微化權』入福德，個性好勝不認輸，對於金錢觀是敢賺敢花，會使用比較高檔的物品"
    ]
  },
  "天機": {
    "代表人物": "周文王的軍師〔姜太公〕",
    "五行": "乙木",
    "特質": [
      "益算之、智多、善於思考、邏輯推理、運籌帷幄，主計畫、企劃、規劃",
      "化氣為善，與天梁並稱『善蔭之』，主宗教、玄學、哲學；串連根器宮位（福德、子女、遷移）主命理、佛法、禪修、冥想、哲學",
      "為『驛馬』，主遷徙、變動（屬於來回驛馬，須配合遷移宮論述）",
      "姜太公自封為門神，故天機類象為軸承、腳踏車、機車、轎車、軌道、小工場、汽車保修場、小機器、機械相關科系",
      "乙木類象為花草、矮木、盆栽"
    ],
    "身體部位_化忌": [
      "類軸承，故論關節、脊椎",
      "乙木主筋脈、四肢（手、趾）、毛髮、痠痛、末梢行血",
      "智慧之，主精神、神經系統、失眠、神經衰弱、精神耗弱、精神病",
      "多忌容易造成忘性、路癡、恍神、數理差、記憶力差"
    ],
    "四化": {
      "化祿": "乙天機化祿",
      "化權": "丙天機化權",
      "化科": "丁天機化科",
      "化忌": "戊天機化忌"
    },
    "化象註解": [
      "化祿：態度寬容、多元，在工作上點子多，擅長企劃，是好幕僚，但並非敬業（不夠專注）",
      "化權：強大的力量，積極掌控工作，工作能力強，技術好，如汽車修護工技術不賴；權需祿緣來會以發揮",
      "化科：溫和細膩的力量，工作態度理智緩行，慢條斯理，做工精緻細膩，文書工作有條不紊",
      "化忌：執著付出，在乎事業並願意付出，工作態度認真敬業，但容易比較死板；單忌喜歡鑽研，2忌以上容易鑽牛角尖",
      "若天機忌串連至破，可能導致積勞成疾、痠痛、睡眠品質差、精神衰弱、或意外傷害到四肢",
      "天機忌串連文昌、文曲忌，容易引起失眠、憂鬱、躁鬱、暈眩、恍惚、自殘、自殺等問題，嚴重者可造成記性差、低能、老人癡呆或精神異常"
    ]
  },
  "太陽": {
    "代表人物": "商朝的忠臣〔比干〕",
    "五行": "丙火",
    "特質": [
      "主光明、日光普照天下，汎愛眾、博愛、無私，主政治",
      "日出日落，主驛馬、忙碌奔波",
      "傳遞能量到全球各地，故主貿易、電話、傳真、資訊、視訊、電視、電腦網路",
      "地球能量的來源，故代表能源、電力、變電所、發電機、大型電器設備、石油、馬達、引擎"
    ],
    "身體部位_化忌": [
      "為乾，主頭部，容易引發頭疼、暈眩",
      "人身主宰者，主心臟，容易引發心臟病、血壓、腦溢血中風（非栓塞性）、心血管疾病",
      "主光明，主眼睛，容易引發近視、眼花、閃光、白內障、青光眼等眼疾、視障"
    ],
    "四化": {
      "化祿": "庚太陽化祿",
      "化權": "辛太陽化權",
      "化科": "無",
      "化忌": "甲太陽化忌"
    },
    "化象註解": [
      "祿權會：太陽祿會太陽權串連呈旺，從事政治、貿易、網路、能源相關事業有好的發展，利於拓展事業版圖，競爭得利，有領導魅力",
      "化忌：太陽忌串連多忌呈破，可能造成弱視或眼盲（會太陰忌特別明顯）、或腦溢血中風",
      "太陽忌入事業，我敬業，也可能執著於政治相關產業",
      "遷移辛太陽化權逢交友庚太陽化祿串連呈旺者，操作政治更有一套"
    ]
  },
  "武曲": {
    "代表人物": "周文王的次子〔姬發〕（周武王）",
    "五行": "辛金",
    "特質": [
      "正財、財帛主、剛毅正直、主觀、剛毅、寡宿（剛則孤寡）",
      "辛金類象：銀行、金融業、金銀製品、紙錢、硬幣、採購組、會計、出納、稅捐處、五金行、金屬類輕重工業混合廠",
      "武曲會七殺，主重型五金，如鐵路、鐵塔、大型金屬器物、火車站、鐵路邊",
      "武曲化忌（壬武曲忌）為茹素象，不再與眾生結惡緣"
    ],
    "身體部位_化忌": [
      "呼吸系統：主胸、肺、乳房、鼻子（如過敏性鼻炎）",
      "辛金主堅硬、發出聲音的部位：牙齒、骨骼（如骨質疏鬆、骨折）、指甲、結石（如膽結石、腎結石、膀胱結石、輸尿管結石）",
      "會廉貞、巨門忌，容易引發肺癌、骨癌、乳癌"
    ],
    "四化": {
      "化祿": "己武曲化祿",
      "化權": "庚武曲化權",
      "化科": "甲武曲化科",
      "化忌": "壬武曲化忌"
    },
    "化象註解": [
      "福德化壬武曲忌，容易偏執重視金錢（正財），愛錢，福德忌入收藏三方容易是鐵公雞",
      "福德化壬武曲忌入交友三方，則願意將福份分享出去，重財布施",
      "命疾福化壬武曲忌，容易堅持吃素（不想再與眾生結惡緣）"
    ]
  },
  "天同": {
    "代表人物": "周文王〔姬昌〕",
    "五行": "壬水",
    "特質": [
      "福、益壽（延壽）",
      "周文王衍周易，故主卦理、方位學（羅盤、堪輿、陽宅學、陰宅學）",
      "福，主美食、餐飲業、俱樂部",
      "主醫療相關產業、大型綜合醫院",
      "福惠大眾，故主服務業",
      "壬水（陽水），主流動的水、飲用水、自來水、灌溉用水、水利、治水相關產業、大溝渠、池塘",
      "有公道伯之稱，擅長調解人事（如遷移化權、交友化祿來會於子女）"
    ],
    "身體部位_化忌": [
      "福，主消化系統（幽門以下）：十二指腸、小腸、大腸、直腸、盲腸、肛門；主食慾、腹脹、腹瀉、便祕、腸胃炎、腸癌（會廉貞、巨門忌）、厭食",
      "壬水，主泌尿系統（膀胱到尿道口）、頻尿",
      "淋巴系統、免疫系統、內分泌系統、賀爾蒙、胰臟",
      "壬水（坎水），主耳朵、聽力、耳鳴，多忌易聾啞（會巨門、文曲忌）",
      "主新陳代謝，與肥胖、水腫有關（會貪狼忌）"
    ],
    "四化": {
      "化祿": "丙天同化祿",
      "化權": "丁天同化權",
      "化科": "無",
      "化忌": "庚天同化忌"
    },
    "化象註解": [
      "福化忌，主災重，若多忌串連呈破，容易發生大災難或危險性高的手術、意外（會廉貞忌）",
      "消化道以幽門為界線，天同管轄幽門到肛門間，巨門管轄胃以上到口之間"
    ]
  },
  "廉貞": {
    "代表人物": "商朝的奸臣〔費仲〕",
    "五行": "丁火",
    "特質": [
      "化氣為囚，故稱囚、法律，主官非、訴訟、罰單，表犯罪、奸邪、是非多爭；亦主軍警、法律",
      "次桃花，主肉慾（男浪蕩，女貪淫），古書稱邪淫，易近酒色、肉慾淫邪；主娛樂業、台灣八大行業（色情行業）",
      "偏財（次於破軍、貪狼），主偏門偏財（投機、賭博）和正規偏財（高所得經營財）",
      "才華，主歌舞技藝才華、音樂、歌舞、技藝、娛樂界",
      "丁火類象：電腦、冰箱、洗衣機、冷氣機、小家電、家電業、電器行",
      "與毒品（成癮難戒）相關的惡習專屬於廉貞，貪狼沒有毒品問題"
    ],
    "身體部位_化忌": [
      "丁火（離火為紅色），主血液、血光、手術、刀傷、燒傷、燙傷、發炎、潰瘍、虛火；容易婦女病、血管栓塞（如腦栓塞中風、心肌梗塞）、動脈裝支架、靜脈瘤",
      "會巨門忌，容易有瘤、癌（難治的癌症，因毒素累積所致）",
      "桃花，主花柳病",
      "細菌、病毒感染、中毒、服毒"
    ],
    "四化": {
      "化祿": "甲廉貞化祿",
      "化權": "無",
      "化科": "無",
      "化忌": "丙廉貞化忌"
    },
    "化象註解": [
      "疾厄『廉貞自化祿出』，容易流血",
      "性格宮化廉貞忌，為感情執著；化廉貞祿，為多情的人",
      "命疾福互化同曜廉貞祿忌，性格有『劈腿傾向』"
    ]
  },
  "貪狼": {
    "代表人物": "商朝的妖妃狐精〔妲己〕",
    "五行": "氣屬甲木，體屬癸水",
    "特質": [
      "主桃花（名曰桃花），為『主桃花』，較重視情調，會先重精神再談肉慾",
      "偏財（次於破軍），主偏門偏財（投機、賭博）和正規偏財（高所得經營財）",
      "才華，涵蓋廉貞，主手藝、專業專技、才藝、文學、藝術（骨董）、藝品、烹飪、巧藝",
      "修行，主純道家修行功夫（山醫命卜相、五術修習、養生術、神仙術）",
      "益壽（狐精千年），喜入壽位（子、午、辰、戌宮）",
      "邪淫（邪則不正，淫則滿溢），主感情、酒、色，性格表現於私生活不檢點、偷腥",
      "甲木類象：大樹（萬物根本）、教化讀書（老師、文教）、建材、原料、棺木、紙、木材",
      "癸水類象：感情、酒、色",
      "福德宮坐或化祿忌，容易有『收藏癖好』（如骨董字畫）"
    ],
    "身體部位_化忌": [
      "甲木主肝、膽、大腿，多忌易引發肝炎、肝硬化、肝癌（會廉貞、巨門忌）、腿疾、截肢、小兒麻痺",
      "癸水主腎，多忌易引發腎病、尿酸痛風（會天機忌）、糖尿病（會廉貞忌）、尿毒洗腎（會廉貞、文曲忌）",
      "腎虛易耳鳴（會天同）、掉髮（會天機忌出）、腰膝無力、精神不濟、婦科疾病（會廉貞忌）",
      "多忌防酒色、縱慾、腎虧、嗜酒等惡習"
    ],
    "四化": {
      "化祿": "戊貪狼化祿",
      "化權": "己貪狼化權",
      "化科": "無",
      "化忌": "癸貪狼化忌"
    },
    "化象註解": [
      "性格宮化貪狼忌，為感情執著；化貪狼祿，為多情的人",
      "命疾福互化同曜貪狼祿忌，性格有『劈腿傾向』",
      "貪狼與天同化忌串連呈破，容易引發病態性肥胖或水腫（因代謝或腎元問題）"
    ]
  },
  "巨門": {
    "代表人物": "姜太公的太太〔馬千金〕",
    "五行": "癸水",
    "特質": [
      "暗（化忌），主小人、是非、口舌、猜忌、疑惑、疑心暗鬼、邪念、意外、車禍",
      "暗，主檯面下、灰色思想、負面思考、陰邪之氣",
      "戶籍，主家門、門戶、戶口、戶籍",
      "品萬物之，主嘴巴，故主零食、愛吃、胃口好",
      "說話，巨門化祿會廉貞或貪狼祿，具有語言藝術天份",
      "旁門左道：無執照工作者、密醫、乩童、江湖術士、金光黨、竊盜、詐騙集團",
      "暗、旁門左道類象：邪術、鬼魅、神壇、小廟、公墓、墳堆、陋巷、破宅、暗溝、下水道、三叉路口、麻將牌",
      "外來的：西藥、小診所、西醫、外來宗教",
      "進出大的門戶：鐵道、運輸、卡車、貨車、國產車（非高級）"
    ],
    "身體部位_化忌": [
      "部位：口、咽喉、食道、胃（幽門以上到口之間）",
      "慢性病：瘤、癌（會廉貞忌）、久病吃藥（藥罐子）",
      "多忌主口腔、語言障礙、聾啞（會天同、文曲忌）、胃病",
      "暗，主中邪、陰氣、卡陰（福德、遷移、子女忌串連呈破）",
      "多忌串連呈破，容易引發意外、車禍（會廉貞忌血光）、中邪、著魔（會天機忌恍神）"
    ],
    "四化": {
      "化祿": "辛巨門化祿",
      "化權": "癸巨門化權",
      "化科": "無",
      "化忌": "丁巨門化忌"
    },
    "化象註解": [
      "命疾福化忌，容易造成灰色思想，多忌忌出容易有自殘、自殺的壞念頭（會天機、文昌、文曲忌）",
      "遷移忌入福德，巨門化忌，防意外、瘤癌、是非小人"
    ]
  },
  "天府": {
    "代表人物": "商朝的皇后〔姜皇后〕",
    "五行": "戊土",
    "特質": [
      "為祿庫，主大地之表（厚土承載萬物以養人）",
      "可畜牧、養殖、山產、土產（如香菇、竹筍、地瓜）",
      "好面子（擺場面）、講究衣著"
    ],
    "身體部位_化忌": [
      "應於人身：主脾、胃（屬土）"
    ],
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "無",
      "化忌": "無"
    },
    "化象註解": [
      "天府沒有四化，故在命理推論時沒有用到"
    ]
  },
  "太陰": {
    "代表人物": "商朝良將黃飛虎的妻子〔賈夫人〕",
    "五行": "癸水",
    "特質": [
      "冰清玉潔、田宅主（母性的築巢慾）、代表月亮，主母、妻、女",
      "月出月落，主驛馬、旅遊、大飯店、出租業（套房、計程車、遊覽車）",
      "帶給人漂亮的事物或產業：服飾、裝飾、美容保養品、化妝品、清潔用品、整形、美容、美髮",
      "田宅主：家具、床、頂級名牌進口轎車、高級住宅",
      "暗，主口舌是非、檯面下、灰色思想、負面思考、陰邪之氣"
    ],
    "身體部位_化忌": [
      "月亮，代表女人的月事、經痛（會廉貞忌）、眼睛（光明，易視障或眼盲，會太陽忌）",
      "冰清玉潔，主皮膚病（會廉貞忌）、整容問題",
      "癸水，主泌尿系統（輸尿管，膀胱以上）",
      "暗，中邪、陰氣、卡陰（福德、遷移、子女化忌串連呈破）"
    ],
    "四化": {
      "化祿": "丁太陰化祿",
      "化權": "戊太陰化權",
      "化科": "庚、癸太陰化科",
      "化忌": "乙太陰化忌"
    },
    "化象註解": [
      "田宅坐太陰忌，重視金錢、房子乾淨",
      "忌入福德，會有長期經痛的困擾",
      "遷移、福德、子女化太陰忌，容易是『鬼遮眼』，或中邪、陰煞"
    ]
  },
  "天相": {
    "代表人物": "商朝的忠臣〔聞太師〕",
    "五行": "壬水",
    "特質": [
      "化氣為印，主權、官職、爵位，司衣食",
      "瀑布、噴泉（非食用水）",
      "手相、面相、摸骨、宅相、墳相、動物相",
      "精緻美食、雞婆、和事老、壽"
    ],
    "身體部位_化忌": "沒有化忌，故不論",
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "無",
      "化忌": "無"
    },
    "化象註解": [
      "天相沒有四化象，在飛斗數中極少使用"
    ]
  },
  "天梁": {
    "代表人物": "周朝的大將〔李靖〕（托塔天王）",
    "五行": "戊土",
    "特質": [
      "蔭（大樹），又稱父母、老大、延壽、百戰不死",
      "主官員、警政、軍人、將官、調查局",
      "高格調、品味：清高、格調、竹、茶葉（品茗）、咖啡（品咖啡）、蘭花；高級住宅、豪宅",
      "善說、膨風，言過其實（須配合表達宮化祿）",
      "本土醫藥：中藥、中醫（會貪狼祿）、專科醫院、高級中藥（會貪狼祿）、藥用植物、天然植物萃取的營養補充食品",
      "蔭：股票長期投資、證券業、獎券業、保險業",
      "與天機並稱『善蔭之』，主宗教、玄學、哲學（本土宗教緣、在中國為佛教）",
      "大樹，主大樓、大型園藝、牧場、森林、原野、自然景觀"
    ],
    "身體部位_化忌": "天梁不化忌，只有對身體的好（延壽），沒有壞的",
    "四化": {
      "化祿": "壬天梁化祿",
      "化權": "乙天梁化權",
      "化科": "己天梁化科",
      "化忌": "無"
    },
    "化象註解": [
      "天梁是老大，夫妻宮坐或化祿，容易是嫁老夫或娶年紀稍長的妻子",
      "化祿權與田宅串連時，住宅屬高格調，視同偏財",
      "天梁會貪狼，串連根器宮位，易習養生術、五術根器強"
    ]
  },
  "七殺": {
    "代表人物": "最後歸順周朝的商朝大將〔黃飛虎〕",
    "五行": "庚金",
    "特質": [
      "化殺為權，肅殺之，與死亡有關，主勇猛果決",
      "恐怖類：蛇、蠍、蜈蚣、爬蟲",
      "軍人、警察、軍隊（肅殺）、軍區",
      "交通與重工業：火車、連結車、輪船、飛機場、火車站、重機械、大型五金、重工業（武曲、七殺同宮）、大型金融機構"
    ],
    "身體部位_化忌": "沒有四化，故不論",
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "無",
      "化忌": "無"
    },
    "化象註解": [
      "七殺沒有四化，在實務運用上極少，只與武曲同宮時運用，論大型五金"
    ]
  },
  "破軍": {
    "代表人物": "商朝最後一位君王〔紂王〕",
    "五行": "癸水",
    "特質": [
      "帝、最大的偏財（經營財）、主破耗、先破壞後建設",
      "癸水（大海水）：主水產、海產、航運、海運、運輸、倉庫、貨櫃、貨櫃車、大拖車、報關行",
      "破耗：玩具、消耗品、雜貨（小北百貨、大賣場）、建築業（先破壞後建設）、怪手",
      "破耗：市場、攤販、夜市、鬧區、貯藏室、垃圾堆（髒亂）、建築工地、環保相關產業、軍火、原油生產、大宗物質、開採業"
    ],
    "身體部位_化忌": "沒有化忌，故不論病",
    "四化": {
      "化祿": "癸破軍化祿",
      "化權": "甲破軍化權",
      "化科": "無",
      "化忌": "無"
    },
    "化象註解": [
      "破軍只有化祿、化權，沒有化忌、化科，因此在人生命運的運用發展上沒有得失，但吉化論述時，祿權代表機會和能力"
    ]
  },
  // 月系與時系
  "左輔": {
    "五行": "戊土",
    "特質": [
      "助善之、秘書、參謀、幕僚",
      "左右為旋，主斡旋、圓巧、司機"
    ],
    "身體部位_化忌": "沒有化忌，故不論",
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "壬左輔化科",
      "化忌": "無"
    },
    "化象註解": [
      "左輔只有化科，主要用在性格的描述"
    ]
  },
  "右弼": {
    "五行": "癸水",
    "特質": [
      "助善之、貴人",
      "善解、機智、傳令、排難解紛、斡旋、司機"
    ],
    "身體部位_化忌": "沒有化忌，故不論",
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "戊右弼化科",
      "化忌": "無"
    },
    "化象註解": [
      "右弼只有化科，主要用在性格的描述"
    ]
  },
  "文昌": {
    "五行": "辛金",
    "特質": [
      "主科甲、聲名、正統文學（文章、書籍）",
      "文書：支票、契約、證件、禮品、紙、筆、文具",
      "護理工作、注射、手術",
      "辛金類象：美工刀、手術刀、小剪刀",
      "時系，主變動、驛馬（變換快）",
      "與文曲同屬文學才華，但文昌為正統文學"
    ],
    "身體部位_化忌": [
      "辛金主支氣管、聲帶（聲音屬金，多忌易沙啞長繭）、斑點（雀斑、肝斑、老人斑）",
      "時系，主精神、神經系統（心理疾病、神經痛），多忌易造成腦神經衰弱、記性差、失眠、憂鬱、躁鬱、恍惚、口吃、老人痴呆、精神異常",
      "身體內部的微細管狀物，如支氣管",
      "多忌易引發手足不仁、漸凍人、帕金森氏症"
    ],
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "丙文昌化科",
      "化忌": "辛文昌化忌"
    },
    "化象註解": [
      "文昌忌會廉貞忌，容易上醫院手術、注射",
      "文昌忌與文曲、天機忌串連呈破，容易引發精神疾病、失眠、記性差等"
    ]
  },
  "文曲": {
    "五行": "癸水",
    "特質": [
      "主文學才華、口才",
      "另類的文學、稗官野史、小說、雜誌、散文",
      "格局好則口才佳，化忌則嘮叨",
      "人緣好、廣交際，感情較多采多姿",
      "時系，主變動、驛馬（變換快）"
    ],
    "身體部位_化忌": [
      "癸水主泌尿系統（輸尿管，膀胱以上）、身體內部的管狀物",
      "多忌易引發尿酸（會貪狼、天機忌）、尿毒（會貪狼、廉貞忌）問題",
      "時系，主精神、神經系統，多忌易造成腦神經衰弱、記性差、失眠、憂鬱、躁鬱、恍惚、口吃、老人痴呆、精神異常"
    ],
    "四化": {
      "化祿": "無",
      "化權": "無",
      "化科": "辛文曲化科",
      "化忌": "己文曲化忌"
    },
    "化象註解": [
      "文曲忌會巨門，主口吃、嘮叨",
      "文曲忌會貪狼、廉貞、太陰，可引發尿毒洗腎",
      "文曲忌與文昌、天機忌串連呈破，容易引發精神疾病、失眠、記性差等"
    ]
  }
};

